{
    "id": "anime-003",
    "name": "Demon Slayer Series",
    "characters": [
        {
            "id": "anime-demonslayer-001",
            "name": "Tanjiro Kamado",
            "rating": 9.5,
            "logo": "assets/images/logos/demon-slayer/tanziro_logo.png",
            "alias": [
                "Sun Breathing User",
                "Earring Boy",
                "Demon with a Human Heart"
            ],
            "title": [
                "Demon Slayer Corps Member",
                "Tsuguko of Urokodaki",
                "Bearer of Hanafuda Earrings"
            ],
            "appearance": {
                "head": {
                    "eyes": "Warm, compassionate maroon eyes that shift to sharp focus during combat. Eyes contain the kindness of his family and determination of his mission. Pupils can become slitted when tapping into demonic memories or intense concentration",
                    "nose": "Exceptionally sensitive nose that can detect emotions, demons, and minute environmental changes. Can smell sadness, lies, and even history of locations. Slightly rounded tip that gives gentle appearance",
                    "ears": "Normal ears adorned with distinctive hanafuda earrings passed through generations. Can hear heartbeats and subtle movements. Earrings jingle softly during movement, becoming a recognizable sound to allies",
                    "extra_facial_features": "Gentle face with kind features that belie his warrior spirit. Prominent scar on forehead that changes form when using Sun Breathing techniques. Black hair with red tips that glow during intense battles. Hair usually tied in ponytail. Expression usually kind but becomes fiercely protective when fighting demons"
                },
                "body": {
                    "chest": "Lean, athletic build developed through brutal training. Chest (40 inches) shows definition without bulk, optimized for breathing techniques. Scar from initial demon attack visible on shoulder. Skin bears numerous training scars from Urokodaki's harsh methods. Breathing causes visible steam during techniques",
                    "arms": "Strong arms with defined muscles from constant sword practice. Biceps (14 inches) show perfect sword-swinging development. Forearms are crisscrossed with scars from battles. Hands are calloused but gentle when caring for Nezuko. Grip strength exceptional for sword control"
                },
                "lower_body": {
                    "legs": "Powerful legs built for the Total Concentration Constant. Thighs (21 inches) show explosive power for Water Breathing techniques. Calves are perfectly toned from mountain running. Can maintain incredible speed and agility for extended periods"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet, allowing maximum sensory perception. Checkered haori hood can be pulled up in rain or snow. Hanafuda earrings constantly worn. Hair tied back to keep vision clear"
                },
                {
                    "torso": "Standard Demon Slayer Corps uniform: black gakuran jacket with bronze buttons. Green and black checkered haori over top, pattern matching his sister's kimono. Uniform reinforced with special fibers that resist demon claws"
                },
                {
                    "arms": "No gauntlets, allowing free movement for sword techniques. Uniform sleeves allow complete range of motion. Hands protected by fingerless gloves when needed"
                },
                {
                    "legs": "Black hakama pants with reinforced knees. Leg wrappings for additional protection. Special tabi boots with split-toe design for better grip and stealth movement"
                },
                {
                    "equipment": "Nichirin sword that changes color to black with red edge. Wooden box for carrying Nezuko during daytime. Medical supplies and demon-slaying tools. Wisteria poison for emergency use"
                }
            ],
            "abilities": [
                {
                    "name": "Water Breathing",
                    "type": "active",
                    "short_description": "Sword techniques that mimic the flow and power of water",
                    "full_description": "First breathing style learned, with 10 forms focusing on fluid movement and precise strikes. Creates visual effects of flowing water during attacks. Techniques range from defensive (Water Wheel) to offensive (Striking Tide). Forms can be modified and combined. Mastery allows cutting through anything with water-like persistence",
                    "image": "tanjiro_water_breathing.png"
                },
                {
                    "name": "Sun Breathing",
                    "type": "active",
                    "short_description": "Original breathing style from which all others derive, mimicking the sun",
                    "full_description": "Most powerful breathing style with 13 forms. Creates solar flame visual effects. Can actually burn demons like sunlight. Passed down through family dance. Each form corresponds to different solar phenomena. When mastered, sword glows bright red and leaves burning trails. Can be combined with Water Breathing for unique techniques",
                    "image": "tanjiro_sun_breathing.png"
                }
            ],
            "gallery": [
                "assets/images/characters/tanjiro_initial.png",
                "assets/images/characters/tanjiro_water_breathing.png",
                "assets/images/characters/tanjiro_hinokami_kagura.png",
                "assets/images/characters/tanjiro_demon_form.png",
                "assets/images/characters/tanjiro_hashira.png"
            ]
        },
        {
            "id": "anime-demonslayer-002",
            "name": "Nezuko Kamado",
            "rating": 9.4,
            "logo": "assets/images/logos/demon-slayer/nezuko_logo.png",
            "alias": [
                "Demon Sister",
                "Chibi Demon",
                "Bamboo Muzzle Girl",
                "Blood Demon Art User"
            ],
            "title": [
                "Demon Protector",
                "Kamado Family Survivor",
                "Demon Slayer Corps Special Exception"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, expressive pink eyes that change from gentle to fierce. Pupils become slitted when in combat mode. Eyes convey childlike innocence despite demon nature. Can communicate emotions through eye movements alone",
                    "nose": "Normal human nose that retains some sensitivity. Often wrinkled when smelling danger. Bamboo muzzle covers lower face, secured by red cord",
                    "ears": "Normal ears partially hidden by long black hair. Can hear subtle sounds even in sleep. Hair ornaments (now gone) replaced by natural hair color gradient",
                    "extra_facial_features": "Pale demon skin that glows in moonlight. Black hair fading to orange-red at tips. Hair grows when using powers. Small fangs visible when mouth opens. Bamboo muzzle prevents biting. Childlike face that belies growing power"
                },
                "body": {
                    "chest": "Petite frame that shrinks to child size to conserve energy. Chest (32 inches) shows no definition due to child form. Demon markings appear on skin when using powers. Skin is pale but warm to touch for allies",
                    "arms": "Slender arms with hidden strength. Biceps (9 inches) can expand with demon power. Hands have sharp black nails that can extend into claws. Wears simple kimono sleeves"
                },
                "lower_body": {
                    "legs": "Short legs in child form, normal length when grown. Thighs (16 inches) contain explosive power for kicking. Can regenerate limbs instantly. Often barefoot or wearing simple sandals"
                }
            },
            "armor_costume": [
                {
                    "head": "Bambose muzzle secured with red cord. No other headwear. Hair worn loose or in simple style. Former hair ornament replaced by natural color"
                },
                {
                    "torso": "Pink kimono with black patterns, originally her mother's. Red obi sash. Simple undergarments. Kimono sleeves allow free movement"
                },
                {
                    "arms": "No armor or protection. Kimono sleeves cover arms. Hands usually kept at sides unless fighting"
                },
                {
                    "legs": "Kimono skirt allows kicking freedom. No leg armor. Often barefoot or wearing simple footwear when provided"
                },
                {
                    "equipment": "Wooden box for daytime travel. No weapons besides natural demon abilities. Sometimes carries small pouch given by brother"
                }
            ],
            "abilities": [
                {
                    "name": "Blood Demon Art: Exploding Blood",
                    "type": "active",
                    "short_description": "Manipulates own blood to create explosive or protective effects",
                    "full_description": "Primary Blood Demon Art. Can ignite blood to create explosions or form protective barriers. Pink flames are harmless to humans but destructive to demons. Can create concentrated bursts or wide-area explosions. Grows more powerful with emotional triggers",
                    "image": "nezuko_blood_art.png"
                },
                {
                    "name": "Size Manipulation",
                    "type": "passive/active",
                    "short_description": "Can shrink to child size or grow to adult form",
                    "full_description": "Unique ability to conserve energy by shrinking body. Child form uses less energy and maintains human cognition. Adult form increases physical power dramatically. Transformation triggered by combat needs or emotional states",
                    "image": "nezuko_size_change.png"
                },
                {
                    "name": "Daytime Resistance",
                    "type": "passive",
                    "short_description": "Can survive sunlight exposure without disintegrating",
                    "full_description": "Unique among demons. Can walk in sunlight without burning. Possibly due to human willpower or unique transformation. Sunlight still weakens but doesn't destroy. Requires more energy when in sunlight",
                    "image": "nezuko_sunlight.png"
                }
            ],
            "gallery": [
                "assets/images/characters/nezuko_child.png",
                "assets/images/characters/nezuko_adult.png",
                "assets/images/characters/nezuko_blood_art.png",
                "assets/images/characters/nezuko_protector.png",
                "assets/images/characters/nezuko_sunlight.png"
            ]
        },
        {
            "id": "anime-demonslayer-003",
            "name": "Zenitsu Agatsuma",
            "rating": 9.0,
            "logo": "assets/images/logos/demon-slayer/zenitsu_logo.png",
            "alias": [
                "Thunder Breath User",
                "Cowardly Swordsman",
                "Sleeping Warrior",
                "Crybaby Slayer"
            ],
            "title": [
                "Demon Slayer Corps Member",
                "Thunder Breathing Successor",
                "Self-Proclaimed Tanjiro's Best Friend"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, expressive golden-brown eyes that often tear up. Pupils shrink to dots when terrified. In sleep, eyes remain closed but senses active. Can see lightning trails even with eyes closed",
                    "nose": "Normal nose, very sensitive to demon scents. Wrinkles when crying or scared. Can sniff out danger before seeing it",
                    "ears": "Exceptional hearing that detects heartbeats, emotions, and minute movements. Ears twitch when detecting lies or danger. Normal appearance but function supernaturally",
                    "extra_facial_features": "Boyish face with permanent anxious expression. Peach-colored hair with yellow gradient at tips. Hair spikes when using Thunder Breathing. Often has tear stains on cheeks. Mouth either trembling or determined line"
                },
                "body": {
                    "chest": "Slender build that hides explosive power. Chest (38 inches) expands dramatically when using breathing techniques. Wears standard uniform under yellow haori. Skin bears light scars from training",
                    "arms": "Deceptively strong arms from constant sword practice. Biceps (13 inches) contain lightning-fast reflexes. Hands tremble when scared but steady in sleep. Calloused from gripping sword"
                },
                "lower_body": {
                    "legs": "Legs built for incredible speed. Thighs (20 inches) contain power for Thunder Breathing First Form. Calves perfectly developed for instant acceleration. Can move faster than eye can follow"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair often messy from running. Sometimes wears simple headband. Ears always exposed for maximum hearing"
                },
                {
                    "torso": "Standard Demon Slayer uniform. Distinctive yellow haori with white triangle pattern. Haori represents lightning. Uniform often disheveled from panic"
                },
                {
                    "arms": "No gauntlets. Uniform sleeves rolled up sometimes. Wears fingerless gloves for better grip"
                },
                {
                    "legs": "Standard hakama pants. Leg wrappings for support. Special tabi boots reinforced for high-speed movement"
                },
                {
                    "equipment": "Nichirin sword that turns yellow with lightning patterns. Standard demon-slaying kit. Extra thunderclap bombs. Always carries debt collection notices"
                }
            ],
            "abilities": [
                {
                    "name": "Thunder Breathing: First Form - Thunderclap and Flash",
                    "type": "active",
                    "short_description": "Extremely fast forward dash and slash",
                    "full_description": "Mastered single form of Thunder Breathing. Moves at lightning speed leaving golden trail. Can be used in sixfold or eightfold variations for multiple strikes. Speed increases when unconscious. Creates actual thunderclap sound. Cuts before demon can react",
                    "image": "zenitsu_thunderclap.png"
                },
                {
                    "name": "Enhanced Hearing",
                    "type": "passive",
                    "short_description": "Supernatural hearing ability",
                    "full_description": "Can hear heartbeats, emotions, muscle movements, and even spiritual presence. Detects lies and intentions. Can pinpoint weaknesses in enemy stance. Hearing so acute it causes pain in loud environments",
                    "image": "zenitsu_hearing.png"
                },
                {
                    "name": "Sleep Fighting",
                    "type": "passive/active",
                    "short_description": "Fights at full power while unconscious",
                    "full_description": "When terrified, falls asleep and fights instinctively. Eliminates hesitation and fear. Techniques become more refined. Can access full potential without mental blocks. Wakes up unaware of actions",
                    "image": "zenitsu_sleep.png"
                }
            ],
            "gallery": [
                "assets/images/characters/zenitsu_crying.png",
                "assets/images/characters/zenitsu_thunder.png",
                "assets/images/characters/zenitsu_sleeping.png",
                "assets/images/characters/zenitsu_determined.png",
                "assets/images/characters/zenitsu_seventh_form.png"
            ]
        },
        {
            "id": "anime-demonslayer-004",
            "name": "Inosuke Hashibira",
            "rating": 9.1,
            "logo": "assets/images/logos/demon-slayer/inosuke_logo.png",
            "alias": [
                "Beast Breathing User",
                "Boar Head Boy",
                "King of the Mountains",
                "Wild Child"
            ],
            "title": [
                "Demon Slayer Corps Member",
                "Self-Proclaimed Mountain King",
                "Dual Wielder"
            ],
            "appearance": {
                "head": {
                    "eyes": "Sharp, fierce emerald green eyes visible through boar mask. Pupils contract to predatory slits when excited. Eyes glow with fighting spirit. Can see in near-darkness from mountain living",
                    "nose": "Exceptionally sensitive nose, nearly equal to Tanjiro's. Can track by scent alone. Often sniffs loudly when curious. Nose wrinkles when angry or confused",
                    "ears": "Normal ears hidden by wild hair. Can hear subtle sounds from wilderness training. Ears perk up at challenge or food mention",
                    "extra_facial_features": "Surprisingly beautiful feminine face that contrasts wild personality. Pale skin with delicate features. Blue-black hair worn wild and untamed. Often wears boar head mask. Mouth either in fierce grin or pout"
                },
                "body": {
                    "chest": "Extremely muscular and defined torso. Chest (44 inches) shows perfect muscle development. Covered in scars from mountain fights. Skin pale from lack of sun exposure. Abs clearly defined even at rest",
                    "arms": "Massively powerful arms from wilderness survival. Biceps (16 inches) bulge with raw power. Shoulders broad and heavily muscled. Hands calloused and scarred. Can grip with crushing force"
                },
                "lower_body": {
                    "legs": "Powerful legs built for leaping and climbing. Thighs (24 inches) like tree trunks. Calves perfectly developed for mountain terrain. Can run on all fours at incredible speed"
                }
            },
            "armor_costume": [
                {
                    "head": "Boar head mask made from actual boar head. Worn constantly except when eating or sleeping. Mask has fierce expression. His own face rarely seen by others"
                },
                {
                    "torso": "No shirt, exposing muscular torso. Wears fur pelt over shoulders. Later adds standard uniform pants but often leaves chest bare. Tribal markings sometimes painted on skin"
                },
                {
                    "arms": "No armor. Arms completely exposed. Wrist wrappings for grip. Often has fresh scratches or wounds"
                },
                {
                    "legs": "Standard hakama pants but often torn or modified. Leg wrappings for climbing. Barefoot or simple foot coverings"
                },
                {
                    "equipment": "Two notched Nichirin swords with serrated edges. Crude self-made sheaths. Often carries foraged food. Minimal demon-slaying supplies"
                }
            ],
            "abilities": [
                {
                    "name": "Beast Breathing",
                    "type": "active",
                    "short_description": "Self-developed breathing style mimicking wild beasts",
                    "full_description": "Unique breathing style with 10 fang techniques. Focuses on unpredictable, wild movements. Dual-wielding creates whirlwind of attacks. Can sense openings like animal sensing weakness. Techniques named after beast fangs and claws",
                    "image": "inosuke_beast_breathing.png"
                },
                {
                    "name": "Spatial Awareness",
                    "type": "passive",
                    "short_description": "Can sense space and objects without sight",
                    "full_description": "Developed in pitch-dark mountains. Can sense surroundings through air currents, vibrations, and instinct. Can fight blindfolded. Detects invisible attacks. Spatial memory is perfect",
                    "image": "inosuke_spatial.png"
                },
                {
                    "name": "Flexible Joints",
                    "type": "passive",
                    "short_description": "Can contort body in unnatural ways",
                    "full_description": "Joints can dislocate and reposition at will. Can squeeze through impossibly small spaces. Attacks come from unexpected angles. Makes defense against him nearly impossible",
                    "image": "inosuke_flexible.png"
                }
            ],
            "gallery": [
                "assets/images/characters/inosuke_boar_mask.png",
                "assets/images/characters/inosuke_unmasked.png",
                "assets/images/characters/inosuke_beast_breathing.png",
                "assets/images/characters/inosuke_dual_wield.png",
                "assets/images/characters/inosuke_tantrum.png"
            ]
        },
        {
            "id": "anime-demonslayer-005",
            "name": "Giyu Tomioka",
            "rating": 9.6,
            "logo": "assets/images/logos/demon-slayer/giyu_logo.png",
            "alias": [
                "Water Hashira",
                "The Lonely Hashira",
                "Tomioka-sensei",
                "Eleventh Form User"
            ],
            "title": [
                "Water Hashira of Demon Slayer Corps",
                "Former Tsuguko of Urokodaki",
                "Tanjiro's Sponsor"
            ],
            "appearance": {
                "head": {
                    "eyes": "Deep blue, perpetually serious eyes. Expression rarely changes. Eyes show focus and melancholy. Can see water flow in movements. Pupils sharpen during combat",
                    "nose": "Straight, aristocratic nose. Normal sensitivity. Often wrinkles slightly at strong odors",
                    "ears": "Normal ears partially covered by hair. Can hear subtle sounds. Often ignores conversational noise",
                    "extra_facial_features": "Handsome but stern face. Black hair with uneven cut. Left side longer, right side shorter. Wears hair loose. Permanent serious expression. Rarely smiles"
                },
                "body": {
                    "chest": "Lean, athletic build. Chest (41 inches) shows perfect swordsman physique. No unnecessary bulk. Skin bears Hashira-level scars. Always maintains perfect posture",
                    "arms": "Long, powerful arms for Water Breathing. Biceps (14.5 inches) perfectly developed. Forearms show defined muscles. Hands have sword callouses. Grip is precise and strong"
                },
                "lower_body": {
                    "legs": "Strong legs built for fluid movement. Thighs (22 inches) powerful but lean. Calves developed for quick directional changes. Always balanced perfectly"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair worn loose. Sometimes wears standard Corps headband. Forehead usually exposed"
                },
                {
                    "torso": "Standard Hashira uniform with haori. Two-toned haori: right side red, left side green-checkered pattern. Uniform perfectly maintained. No unnecessary accessories"
                },
                {
                    "arms": "Standard uniform sleeves. No additional armor. Wears fingerless gloves sometimes"
                },
                {
                    "legs": "Standard hakama pants. Leg wrappings for support. Tabi boots for silent movement"
                },
                {
                    "equipment": "Standard Nichirin sword that turns deep blue. Standard demon-slaying kit. Always carries Corps regulations. Minimal personal items"
                }
            ],
            "abilities": [
                {
                    "name": "Water Breathing: All Forms",
                    "type": "active",
                    "short_description": "Master of all Water Breathing techniques",
                    "full_description": "Has mastered all 10 standard forms plus created Eleventh Form. Techniques create massive water dragon effects. Can shift between forms seamlessly. Water effects are clearer and larger than other users",
                    "image": "giyu_water_breathing.png"
                },
                {
                    "name": "Dead Calm (Eleventh Form)",
                    "type": "active",
                    "short_description": "Absolute defensive technique",
                    "full_description": "Personal creation, not taught. Enters state of complete calm. Can nullify all incoming attacks within range. Creates zone of perfect defense. Requires immense concentration",
                    "image": "giyu_dead_calm.png"
                },
                {
                    "name": "Hashira-Level Strength",
                    "type": "passive",
                    "short_description": "Peak human physical abilities",
                    "full_description": "All physical attributes at maximum human potential. Speed, strength, endurance, reflexes all elite. Can fight Upper Moons evenly. Recovery rate exceptional",
                    "image": "giyu_hashira.png"
                }
            ],
            "gallery": [
                "assets/images/characters/giyu_serious.png",
                "assets/images/characters/giyu_water_forms.png",
                "assets/images/characters/giyu_dead_calm.png",
                "assets/images/characters/giyu_flashback.png",
                "assets/images/characters/giyu_smile.png"
            ]
        },
        {
            "id": "anime-demonslayer-006",
            "name": "Shinobu Kocho",
            "rating": 9.5,
            "logo": "assets/images/logos/demon-slayer/shinobu_logo.png",
            "alias": [
                "Insect Hashira",
                "Butterfly Girl",
                "The Poison User",
                "Smiling Demon"
            ],
            "title": [
                "Insect Hashira of Demon Slayer Corps",
                "Butterfly Estate Master",
                "Corps Medical Chief"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, gentle purple eyes that always smile. Eyes hide deep pain and anger. Pupils remain soft even in combat. Can see minute details like insect movements",
                    "nose": "Delicate nose with normal sensitivity. Often wrinkles when smelling poison or medicine",
                    "ears": "Small, delicate ears usually hidden by hair. Can hear whispers and subtle sounds",
                    "extra_facial_features": "Beautiful, doll-like face with permanent gentle smile. Dark purple hair with gradient to lighter purple. Hair styled in side ponytail. Butterfly hairpin. Always smiling, never shows true anger"
                },
                "body": {
                    "chest": "Small, delicate frame that hides strength. Chest (34 inches) appears fragile. Actually highly trained but lacks brute force. Skin pale from indoor work. Always perfect posture",
                    "arms": "Slender arms designed for precision. Biceps (10 inches) contain surprising strength. Hands delicate but steady for medical work. Can perform precise strikes"
                },
                "lower_body": {
                    "legs": "Slender legs built for agility. Thighs (18 inches) allow quick movements. Calves developed for insect-like footwork. Always moves gracefully"
                }
            },
            "armor_costume": [
                {
                    "head": "Butterfly hairpin on right side. Hair in side ponytail. No helmet. Always looks perfectly groomed"
                },
                {
                    "torso": "Standard Hashira uniform modified. White haori with butterfly wing pattern. Uniform includes corset-like top. Colors: white and purple theme"
                },
                {
                    "arms": "Standard sleeves. No armor. Hands often gloved for medical work"
                },
                {
                    "legs": "Modified hakama skirt for freedom. Leggings underneath. Tabi boots for silent movement"
                },
                {
                    "equipment": "Unique thin Nichirin sword designed for stabbing. Sword contains poison channels. Carries multiple poison vials. Medical kit always on hand. Butterfly message system"
                }
            ],
            "abilities": [
                {
                    "name": "Insect Breathing",
                    "type": "active",
                    "short_description": "Modified Flower Breathing using poison",
                    "full_description": "Created due to lack of strength for decapitation. Focuses on poison delivery through stabbing. Techniques mimic insect movements. Four main forms plus variations. Paralyzes demons with wisteria poison",
                    "image": "shinobu_insect_breathing.png"
                },
                {
                    "name": "Medical Expertise",
                    "type": "passive/active",
                    "short_description": "Master physician and pharmacist",
                    "full_description": "Heads Corps medical operations. Created anti-demon poisons and medicines. Can perform complex surgeries. Understands demon biology completely. Developed healing regimens for slayers",
                    "image": "shinobu_medical.png"
                },
                {
                    "name": "Poison Mastery",
                    "type": "active",
                    "short_description": "Uses wisteria poison against demons",
                    "full_description": "Sword injects concentrated wisteria poison. Can adjust dosage for paralysis or death. Developed poison lethal only to demons. Carries multiple poison types for different situations",
                    "image": "shinobu_poison.png"
                }
            ],
            "gallery": [
                "assets/images/characters/shinobu_smile.png",
                "assets/images/characters/shinobu_insect_breathing.png",
                "assets/images/characters/shinobu_medical.png",
                "assets/images/characters/shinobu_angry.png",
                "assets/images/characters/shinobu_butterfly.png"
            ]
        },
        {
            "id": "anime-demonslayer-007",
            "name": "Kyojuro Rengoku",
            "rating": 9.8,
            "logo": "assets/images/logos/demon-slayer/rengoku_logo.png",
            "alias": [
                "Flame Hashira",
                "The Passionate Hashira",
                "Big Brother Figure",
                "Set Your Heart Ablaze"
            ],
            "title": [
                "Flame Hashira of Demon Slayer Corps",
                "Rengoku Family Head",
                "Master of Flame Breathing"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, bright gold eyes with red pupils. Eyes burn with passion and determination. Eyebrows and eyelashes flame-shaped. Expression always enthusiastic",
                    "nose": "Strong, straight nose. Normal sensitivity. Often flares when excited",
                    "ears": "Normal ears. Can hear well but often ignores negative comments",
                    "extra_facial_features": "Handsome face with permanent enthusiastic expression. Bright yellow hair with red tips like flames. Hair styled upward. Bushy eyebrows. Always smiling widely"
                },
                "body": {
                    "chest": "Powerful, broad chest. Chest (46 inches) shows immense strength. Perfect Hashira physique. Skin bears few scars due to skill. Always seems larger than life",
                    "arms": "Massive, powerful arms. Biceps (17 inches) like steel. Shoulders extremely broad. Hands large and strong. Grip can crush stone"
                },
                "lower_body": {
                    "legs": "Powerful legs like pillars. Thighs (26 inches) incredibly strong. Calves built for explosive movement. Stance always solid and unwavering"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair styled dramatically upward. Sometimes wears white headband with flame pattern"
                },
                {
                    "torso": "Standard Hashira uniform with haori. White haori with flame pattern on edges. Uniform often open at chest. Colors: white, red, gold theme"
                },
                {
                    "arms": "Standard sleeves rolled up. No armor. Shows off muscular arms"
                },
                {
                    "legs": "Standard hakama pants. Leg wrappings. Tabi boots. Everything perfectly maintained"
                },
                {
                    "equipment": "Standard Nichirin sword that turns red-orange. Standard demon-slaying kit. Always carries extra supplies for others"
                }
            ],
            "abilities": [
                {
                    "name": "Flame Breathing",
                    "type": "active",
                    "short_description": "Powerful breathing style mimicking flames",
                    "full_description": "One of original five breathing styles. Nine forms focusing on powerful, straight-line attacks. Creates actual heat and flame visual effects. Techniques range from basic to ultimate forms. Can burn demons with sheer force",
                    "image": "rengoku_flame_breathing.png"
                },
                {
                    "name": "Enhanced Senses",
                    "type": "passive",
                    "short_description": "Exceptional combat perception",
                    "full_description": "Can sense enemy movements before they happen. Fighting spirit allows prediction of attacks. Can read opponents' techniques quickly. Never caught off guard",
                    "image": "rengoku_senses.png"
                },
                {
                    "name": "Indomitable Will",
                    "type": "passive",
                    "short_description": "Unbreakable spirit and determination",
                    "full_description": "Willpower so strong it affects physical capabilities. Can fight through fatal injuries. Inspires allies with mere presence. Never gives up under any circumstances",
                    "image": "rengoku_will.png"
                }
            ],
            "gallery": [
                "assets/images/characters/rengoku_smile.png",
                "assets/images/characters/rengoku_flame_breathing.png",
                "assets/images/characters/rengoku_train.png",
                "assets/images/characters/rengoku_final_stand.png",
                "assets/images/characters/rengoku_legacy.png"
            ]
        },
        {
            "id": "anime-demonslayer-008",
            "name": "Tengen Uzui",
            "rating": 9.3,
            "logo": "assets/images/logos/demon-slayer/uzui_logo.png",
            "alias": [
                "Sound Hashira",
                "The Flamboyant Hashira",
                "God of Festivals",
                "Ninja Hashira"
            ],
            "title": [
                "Sound Hashira of Demon Slayer Corps",
                "Former Shinobi Leader",
                "Husband to Three Wives"
            ],
            "appearance": {
                "head": {
                    "eyes": "Sharp, purple eyes with red pupils. Eyes glow with intensity. Can see in near darkness. Expression either fierce or dramatically flamboyant",
                    "nose": "Strong nose with piercing. Can smell explosives and chemicals",
                    "ears": "Exceptional hearing from shinobi training. Multiple ear piercings. Can detect heartbeats and breathing patterns",
                    "extra_facial_features": "Extremely handsome face with dramatic makeup. White hair with red tips. Hair styled dramatically. Multiple facial piercings. Always looks flashy and eye-catching"
                },
                "body": {
                    "chest": "Massive, heavily muscled torso. Chest (48 inches) like a wall of muscle. Covered in scars and tattoos. Skin pale with dramatic markings. Physically largest Hashira",
                    "arms": "Enormously powerful arms. Biceps (18 inches) incredibly developed. Six fingers on each hand (polydactyly). Hands can crush skulls easily"
                },
                "lower_body": {
                    "legs": "Powerful legs built for explosive movement. Thighs (28 inches) like tree trunks. Calves perfectly developed for shinobi techniques. Can move silently despite size"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. White headband with gemstones. Hair styled with multiple ornaments. Dramatic eye makeup always present"
                },
                {
                    "torso": "Modified uniform exposing chest. White haori with red flame pattern. Multiple belts and sashes. Carries explosives on chest. Everything flashy and dramatic"
                },
                {
                    "arms": "No sleeves. Arms exposed to show muscles. Wrist guards with explosives. Multiple arm bands and jewelry"
                },
                {
                    "legs": "Loose pants for movement. Multiple belts and sashes. Tabi boots for silent movement. Everything coordinated for flashiness"
                },
                {
                    "equipment": "Dual Nichirin cleavers connected by chain. Multiple explosive bombs and mines. Shinobi tools and poisons. Always carries cosmetic touch-up kit"
                }
            ],
            "abilities": [
                {
                    "name": "Sound Breathing",
                    "type": "active",
                    "short_description": "Personal breathing style using sound waves",
                    "full_description": "Created from Thunder Breathing. Uses explosions and chain weapons. Five forms that create concussive sound waves. Can disorient and damage simultaneously. Techniques are visually and awrally spectacular",
                    "image": "uzui_sound_breathing.png"
                },
                {
                    "name": "Musical Score",
                    "type": "passive/active",
                    "short_description": "Can read enemy movements like musical notation",
                    "full_description": "Unique ability developed as shinobi. Reads opponent's fighting pattern as musical score. Once complete, can predict all movements. Makes him nearly unbeatable in extended fights",
                    "image": "uzui_musical_score.png"
                },
                {
                    "name": "Explosive Mastery",
                    "type": "active",
                    "short_description": "Expert use of explosives in combat",
                    "full_description": "Carries and uses various explosives. Can time detonations perfectly. Uses explosions to enhance movements. Creates diversions and attacks simultaneously",
                    "image": "uzui_explosives.png"
                }
            ],
            "gallery": [
                "assets/images/characters/uzui_flamboyant.png",
                "assets/images/characters/uzui_sound_breathing.png",
                "assets/images/characters/uzui_shinobi.png",
                "assets/images/characters/uzui_serious.png",
                "assets/images/characters/uzui_wives.png"
            ]
        },
        {
            "id": "anime-demonslayer-009",
            "name": "Mitsuri Kanroji",
            "rating": 9.4,
            "logo": "assets/images/logos/demon-slayer/mitsuri_logo.png",
            "alias": [
                "Love Hashira",
                "The Lovestruck Hashira",
                "Muscle Goddess",
                "Pink Hair Hashira"
            ],
            "title": [
                "Love Hashira of Demon Slayer Corps",
                "Strongest Female Muscle Density",
                "Former Marriage Prospect"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, expressive green eyes. Often teary or dreamy. Pupils heart-shaped when excited. Eyes show innocent enthusiasm",
                    "nose": "Small, delicate nose. Normal sensitivity. Often wrinkles when blushing",
                    "ears": "Normal ears hidden by long hair. Can hear compliments from far away",
                    "extra_facial_features": "Extremely beautiful face with innocent expression. Long pink-green gradient hair in three braids. Hair reaches past knees. Always blushing. Mouth either in sweet smile or surprised O"
                },
                "body": {
                    "chest": "Extremely voluptuous figure. Chest (40 inches) unusually large for fighter. Actually has highest muscle density of any Hashira. Skin incredibly soft despite strength. Often wears revealing uniform",
                    "arms": "Slender-looking arms with immense power. Biceps (12 inches) contain super-dense muscles. Hands delicate but grip incredibly strong. Can bend steel with fingers"
                },
                "lower_body": {
                    "legs": "Slender legs with super density. Thighs (20 inches) can kick through stone. Calves perfectly toned. Moves with unusual grace for strength"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair in three long braids. Green and pink ribbons. Sometimes wears hair ornaments"
                },
                {
                    "torso": "Modified uniform exposing midriff. White haori with green pattern. Uniform includes chest wrap. Colors: pink, green, white theme"
                },
                {
                    "arms": "No sleeves. Arms exposed. Wears arm bands. No armor needed"
                },
                {
                    "legs": "Miniskirt version of hakama. Leggings underneath. Tabi boots. Everything cute and feminine"
                },
                {
                    "equipment": "Unique whip-like Nichirin sword. Sword can extend and contract. Standard demon-slaying kit. Always carries love letters and sweets"
                }
            ],
            "abilities": [
                {
                    "name": "Love Breathing",
                    "type": "active",
                    "short_description": "Personal breathing style derived from Flame",
                    "full_description": "Created from Flame Breathing to suit her flexibility. Uses whip-sword for ranged attacks. Six forms focusing on flexibility and range. Techniques create heart and ribbon visual effects. Matches her personality perfectly",
                    "image": "mitsuri_love_breathing.png"
                },
                {
                    "name": "Super Muscle Density",
                    "type": "passive",
                    "short_description": "Muscles eight times denser than normal",
                    "full_description": "Natural physical trait. Appears slender but stronger than any Hashira physically. Can lift immense weights. Strikes have incredible force. Flexibility not reduced by density",
                    "image": "mitsuri_muscles.png"
                },
                {
                    "name": "Enhanced Flexibility",
                    "type": "passive",
                    "short_description": "Can contort body in impossible ways",
                    "full_description": "Joints and muscles extremely flexible. Can dodge attacks from any angle. Sword attacks come from unexpected directions. Makes her fighting style unpredictable",
                    "image": "mitsuri_flexibility.png"
                }
            ],
            "gallery": [
                "assets/images/characters/mitsuri_shy.png",
                "assets/images/characters/mitsuri_love_breathing.png",
                "assets/images/characters/mitsuri_strong.png",
                "assets/images/characters/mitsuri_blushing.png",
                "assets/images/characters/mitsuri_serious.png"
            ]
        },
        {
            "id": "anime-demonslayer-010",
            "name": "Obanai Iguro",
            "rating": 9.2,
            "logo": "assets/images/logos/demon-slayer/obanai_logo.png",
            "alias": [
                "Serpent Hashira",
                "The Stern Hashira",
                "Snake Charmer",
                "Kaburamaru's Partner"
            ],
            "title": [
                "Serpent Hashira of Demon Slayer Corps",
                "Master of Serpent Breathing",
                "Mitsuri's Secret Admirer"
            ],
            "appearance": {
                "head": {
                    "eyes": "Unusual heterochromatic eyes: right yellow, left green. Eyes sharp and judgmental. Rarely show emotion. Can see snake-like movement patterns",
                    "nose": "Covered by bandages. Severely damaged from childhood torture. Can still smell but limited",
                    "ears": "Normal ears. Can hear well. Often ignores what he doesn't want to hear",
                    "extra_facial_features": "Face covered in bandages from mouth injuries. Black hair with uneven bangs. Hair covers right eye sometimes. Permanent stern expression. Rarely smiles"
                },
                "body": {
                    "chest": "Lean, wiry build. Chest (39 inches) shows flexibility over bulk. Covered in scars from snake pit torture. Bandages wrap entire torso. Skin pale from bandage coverage",
                    "arms": "Long, flexible arms. Biceps (13 inches) designed for serpentine movements. Hands always gripping sword. Can twist arms unusually"
                },
                "lower_body": {
                    "legs": "Slender legs built for twisting movements. Thighs (21 inches) allow unique stances. Calves developed for sudden direction changes. Moves like snake"
                }
            },
            "armor_costume": [
                {
                    "head": "Bandages covering lower face. Hair covering one eye. No helmet. Kaburamaru often around neck"
                },
                {
                    "torso": "Standard Hashira uniform with haori. Green and yellow striped haori. Bandages wrap entire torso. Uniform always perfectly neat"
                },
                {
                    "arms": "Standard sleeves. No armor. Bandages on hands sometimes"
                },
                {
                    "legs": "Standard hakama pants. Leg wrappings. Tabi boots. Everything coordinated"
                },
                {
                    "equipment": "Unique curved Nichirin sword like snake fang. Kaburamaru, his pet snake partner. Standard demon-slaying kit. Always carries extra bandages"
                }
            ],
            "abilities": [
                {
                    "name": "Serpent Breathing",
                    "type": "active",
                    "short_description": "Personal breathing style mimicking snakes",
                    "full_description": "Created from Water Breathing. Uses curved sword for twisting attacks. Five forms focusing on unpredictable angles. Sword moves like striking snake. Can attack from blind spots",
                    "image": "obanai_serpent_breathing.png"
                },
                {
                    "name": "Kaburamaru Partnership",
                    "type": "passive/active",
                    "short_description": "Fights alongside pet snake",
                    "full_description": "White snake named Kaburamaru acts as second set of eyes. Can see behind and around corners. Warns of attacks Obanai can't see. They fight as perfect team",
                    "image": "obanai_kaburamaru.png"
                },
                {
                    "name": "Enhanced Flexibility",
                    "type": "passive",
                    "short_description": "Can bend and twist like snake",
                    "full_description": "Body moves in serpentine patterns. Can dodge without moving feet. Attacks come from impossible angles. Makes him extremely difficult to hit",
                    "image": "obanai_flexibility.png"
                }
            ],
            "gallery": [
                "assets/images/characters/obanai_serious.png",
                "assets/images/characters/obanai_serpent_breathing.png",
                "assets/images/characters/obanai_kaburamaru.png",
                "assets/images/characters/obanai_unbandaged.png",
                "assets/images/characters/obanai_mitsuri.png"
            ]
        },
        {
            "id": "anime-demonslayer-011",
            "name": "Sanemi Shinazugawa",
            "rating": 9.3,
            "logo": "assets/images/logos/demon-slayer/sanemi_logo.png",
            "alias": [
                "Wind Hashira",
                "The Fierce Hashira",
                "Marechi Blood Bearer",
                "Genya's Brother"
            ],
            "title": [
                "Wind Hashira of Demon Slayer Corps",
                "Strongest Current Hashira (by statement)",
                "Marechi Blood Carrier"
            ],
            "appearance": {
                "head": {
                    "eyes": "Sharp, fierce purple eyes. Always glaring or angry. Eyes show constant pain and rage. Can see wind currents in combat",
                    "nose": "Strong nose with scar across bridge. Can smell demons easily",
                    "ears": "Normal ears with multiple piercings. Ignores most talking",
                    "extra_facial_features": "Wild, scarred face. White spiky hair. Multiple scars across face. Vertical scar on forehead. Mouth either in snarl or smirk. Always looks angry"
                },
                "body": {
                    "chest": "Heavily muscled and scarred torso. Chest (45 inches) covered in scars. Self-inflicted wounds from marechi blood collection. Skin pale with many markings. Always tense",
                    "arms": "Powerful, scarred arms. Biceps (16 inches) heavily developed. Forearms covered in cuts and scars. Hands always ready to fight"
                },
                "lower_body": {
                    "legs": "Powerful legs built for aggressive movement. Thighs (25 inches) like pistons. Calves developed for charging attacks. Always in fighting stance"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. White headband sometimes. Hair wild and spiky. Always looks disheveled"
                },
                {
                    "torso": "Standard Hashira uniform open at chest. Green haori with triangle pattern. Uniform often bloody or torn. Shows off scars intentionally"
                },
                {
                    "arms": "No sleeves. Arms exposed to show scars. Bandages on forearms. No gloves"
                },
                {
                    "legs": "Standard hakama pants. Often torn or bloody. Leg wrappings. Tabi boots"
                },
                {
                    "equipment": "Standard Nichirin sword that turns green. Multiple knives for blood drawing. Demon-slaying kit. Always carries bandages for self-wounding"
                }
            ],
            "abilities": [
                {
                    "name": "Wind Breathing",
                    "type": "active",
                    "short_description": "Powerful breathing style creating wind blades",
                    "full_description": "One of original five breathing styles. Nine forms focusing on cutting power and range. Creates visible wind blades that extend reach. Techniques can clear wide areas. Matches his aggressive personality",
                    "image": "sanemi_wind_breathing.png"
                },
                {
                    "name": "Marechi Blood",
                    "type": "passive",
                    "short_description": "Rare blood type that intoxicates demons",
                    "full_description": "Blood so delicious it drives demons wild. Causes loss of control and focus. Uses own blood as weapon. Can draw blood mid-fight to distract demons",
                    "image": "sanemi_marechi.png"
                },
                {
                    "name": "Indomitable Spirit",
                    "type": "passive",
                    "short_description": "Unbreakable will and pain tolerance",
                    "full_description": "Can fight through any injury. Ignores pain completely. Willpower so strong it affects physical capabilities. Never retreats from fight",
                    "image": "sanemi_will.png"
                }
            ],
            "gallery": [
                "assets/images/characters/sanemi_angry.png",
                "assets/images/characters/sanemi_wind_breathing.png",
                "assets/images/characters/sanemi_scars.png",
                "assets/images/characters/sanemi_genya.png",
                "assets/images/characters/sanemi_rare_smile.png"
            ]
        },
        {
            "id": "anime-demelslayer-012",
            "name": "Gyomei Himejima",
            "rating": 9.7,
            "logo": "assets/images/logos/demon-slayer/gyomei_logo.png",
            "alias": [
                "Stone Hashira",
                "The Crying Hashira",
                "Strongest Hashira",
                "Blind Warrior"
            ],
            "title": [
                "Stone Hashira of Demon Slayer Corps",
                "Strongest Demon Slayer (Current Era)",
                "Orphanage Caretaker"
            ],
            "appearance": {
                "head": {
                    "eyes": "Milky white blind eyes. Always crying. Eyes show past trauma. Despite blindness, sees more than sighted people",
                    "nose": "Strong nose. Can smell emotions and intentions",
                    "ears": "Exceptional hearing compensates for blindness. Can hear heartbeats and muscle movements",
                    "extra_facial_features": "Giant, gentle face always streaked with tears. Bald head. Prayer beads around neck. Mouth either in prayer or determined line"
                },
                "body": {
                    "chest": "Massive, muscular torso like stone wall. Chest (52 inches) largest of all Hashira. Muscles like carved rock. Skin dark and heavily scarred. Bears prayer beads on chest",
                    "arms": "Enormously powerful arms. Biceps (20 inches) like boulders. Hands massive, can crush demons head. Calloused from weapon use"
                },
                "lower_body": {
                    "legs": "Pillar-like legs. Thighs (32 inches) incredibly strong. Calves like stone columns. Stance unshakable"
                }
            },
            "armor_costume": [
                {
                    "head": "No hair. Prayer beads around neck. Sometimes wears simple headband. Always crying"
                },
                {
                    "torso": "Simple monk robes over uniform. No haori. Robes allow free movement. Colors: brown and white theme"
                },
                {
                    "arms": "Robes cover arms. No armor needed. Shows arms when fighting"
                },
                {
                    "legs": "Simple pants. Leg wrappings. Sturdy sandals. Everything practical, not decorative"
                },
                {
                    "equipment": "Unique flail and axe weapon. Prayer beads used as weapon too. Standard demon-slaying kit. Always carries prayer beads and religious items"
                }
            ],
            "abilities": [
                {
                    "name": "Stone Breathing",
                    "type": "active",
                    "short_description": "Original breathing style mimicking stone",
                    "full_description": "One of original five breathing styles. Five forms focusing on immense power and defense. Creates stone-like visual effects. Weapon is flail and axe combination. Techniques are slow but unstoppable",
                    "image": "gyomei_stone_breathing.png"
                },
                {
                    "name": "Transparent World",
                    "type": "passive",
                    "short_description": "Can see inside bodies despite blindness",
                    "full_description": "Achieved through training. Can see muscles, blood flow, bone structure. Predicts movements before they happen. Makes blindness irrelevant in combat",
                    "image": "gyomei_transparent_world.png"
                },
                {
                    "name": "Superhuman Strength",
                    "type": "passive",
                    "short_description": "Physically strongest human",
                    "full_description": "Natural physical power beyond any Hashira. Can lift and throw immense weights. Strikes can shatter stone. Defense is impenetrable",
                    "image": "gyomei_strength.png"
                }
            ],
            "gallery": [
                "assets/images/characters/gyomei_crying.png",
                "assets/images/characters/gyomei_stone_breathing.png",
                "assets/images/characters/gyomei_weapon.png",
                "assets/images/characters/gyomei_serious.png",
                "assets/images/characters/gyomei_orphans.png"
            ]
        },
        {
            "id": "anime-demonslayer-013",
            "name": "Muichiro Tokito",
            "rating": 9.3,
            "logo": "assets/images/logos/demon-slayer/muichiro_logo.png",
            "alias": [
                "Mist Hashira",
                "The Forgetful Hashira",
                "Prodigy Slayer",
                "Twin Brother"
            ],
            "title": [
                "Mist Hashira of Demon Slayer Corps",
                "Youngest Hashira in History",
                "Tokito Twin Survivor"
            ],
            "appearance": {
                "head": {
                    "eyes": "Distant, foggy turquoise eyes. Often unfocused or daydreaming. Eyes clear during combat. Show past trauma when remembering",
                    "nose": "Small, delicate nose. Normal sensitivity",
                    "ears": "Normal ears hidden by hair. Often ignores sounds when spaced out",
                    "extra_facial_features": "Androgynously beautiful face. Long black hair with turquoise tips. Hair covers most of face. Permanent distant expression. Rarely shows emotion"
                },
                "body": {
                    "chest": "Slender, youthful build. Chest (36 inches) shows surprising strength. Skin pale and unmarked. Looks fragile but isn't",
                    "arms": "Slender arms with hidden power. Biceps (12 inches) contain prodigious strength. Hands delicate but sword grip perfect"
                },
                "lower_body": {
                    "legs": "Slender legs built for mist-like movement. Thighs (19 inches) allow quick vanishing. Calves developed for agile footwork. Moves like fog"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Long hair covers face. Sometimes wears simple headband. Looks always dreamy"
                },
                {
                    "torso": "Standard Hashira uniform with haori. White cloud-patterned haori. Uniform loose-fitting. Colors: white and blue theme"
                },
                {
                    "arms": "Loose sleeves. No armor. Hands often in pockets"
                },
                {
                    "legs": "Loose hakama pants. Leg wrappings. Tabi boots. Everything seems too big for him"
                },
                {
                    "equipment": "Standard Nichirin sword that turns pale blue. Standard demon-slaying kit. Often forgets where he put things"
                }
            ],
            "abilities": [
                {
                    "name": "Mist Breathing",
                    "type": "active",
                    "short_description": "Breathing style creating mist effects",
                    "full_description": "Derived from Wind Breathing. Seven forms focusing on obscuring movement. Creates mist that hides user. Techniques are swift and precise. Matches his elusive personality",
                    "image": "muichiro_mist_breathing.png"
                },
                {
                    "name": "Prodigy Talent",
                    "type": "passive",
                    "short_description": "Natural genius at swordsmanship",
                    "full_description": "Became Hashira in two months. Learns techniques instantly. Can create new forms spontaneously. Natural talent beyond hard work",
                    "image": "muichiro_prodigy.png"
                },
                {
                    "name": "Mark of the Demon Slayer",
                    "type": "passive/active",
                    "short_description": "Awakened demon slayer mark",
                    "full_description": "Mark appears on cheek when activated. Dramatically increases all abilities. Allows access to Transparent World. Shortens lifespan but grants immense power",
                    "image": "muichiro_mark.png"
                }
            ],
            "gallery": [
                "assets/images/characters/muichiro_distant.png",
                "assets/images/characters/muichiro_mist_breathing.png",
                "assets/images/characters/muichiro_mark.png",
                "assets/images/characters/muichiro_memory.png",
                "assets/images/characters/muichiro_twin.png"
            ]
        },
        {
            "id": "anime-demonslayer-014",
            "name": "Kokushibo",
            "rating": 9.9,
            "logo": "assets/images/logos/demon-slayer/kokushibo_logo.png",
            "alias": [
                "Upper Moon One",
                "The Strongest Upper Moon",
                "Michikatsu Tsugikuni",
                "Yoriichi's Brother"
            ],
            "title": [
                "Upper Rank One of Twelve Kizuki",
                "Former Demon Slayer",
                "Moon Breathing Creator",
                "Centuries-Old Demon"
            ],
            "appearance": {
                "head": {
                    "eyes": "Six demon eyes with yellow irises and red pupils. Three pairs vertically aligned. Eyes show centuries of experience. Can see all directions simultaneously",
                    "nose": "Normal demon nose. Can smell blood and fear",
                    "ears": "Normal ears. Can hear centuries of battles",
                    "extra_facial_features": "Pale demon skin with dark red markings. Long black hair with red tips. Hair styled in ponytail. Face shows nobility and age. Permanent serious expression. Horns on forehead"
                },
                "body": {
                    "chest": "Tall, muscular torso. Chest (50 inches) shows centuries of power. Skin pale with demon markings. Multiple arms when using full power. Always imposing",
                    "arms": "Multiple arms in battle form. Biceps (16 inches each) contain immense power. Hands grip unique sword. Can grow additional arms as needed"
                },
                "lower_body": {
                    "legs": "Powerful legs built for stability. Thighs (30 inches) like pillars. Calves developed for centuries of combat. Stance unshakable"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair in high ponytail. Horns visible. Six eyes always watching"
                },
                {
                    "torso": "Simple dark kimono. No armor needed. Kimono opens to show chest. Colors: dark purple and black"
                },
                {
                    "arms": "Kimono sleeves. Arms exposed when fighting. Shows multiple arms in combat"
                },
                {
                    "legs": "Traditional hakama pants. No leg armor. Simple sandals"
                },
                {
                    "equipment": "Unique flesh sword that grows from body. Sword can extend and contract. No other equipment needed"
                }
            ],
            "abilities": [
                {
                    "name": "Moon Breathing",
                    "type": "active",
                    "short_description": "Most powerful demon breathing style",
                    "full_description": "Created from Sun Breathing. Sixteen forms with countless variations. Creates crescent moon blades that extend endlessly. Techniques can cover entire areas. Most complex breathing style in existence",
                    "image": "kokushibo_moon_breathing.png"
                },
                {
                    "name": "Centuries of Experience",
                    "type": "passive",
                    "short_description": "Over 400 years of combat knowledge",
                    "full_description": "Has fought countless demon slayers. Knows all breathing styles and counters. Cannot be surprised by any technique. Adapts instantly to opponents",
                    "image": "kokushibo_experience.png"
                },
                {
                    "name": "Demon Art: Blade Manifestation",
                    "type": "active",
                    "short_description": "Can create blades from body",
                    "full_description": "Grows katana from flesh that can extend. Blade has flesh-eye that sees everything. Can create multiple blades simultaneously. Blades regenerate instantly if broken",
                    "image": "kokushibo_blade.png"
                }
            ],
            "gallery": [
                "assets/images/characters/kokushibo_serious.png",
                "assets/images/characters/kokushibo_moon_breathing.png",
                "assets/images/characters/kokushibo_multiple_arms.png",
                "assets/images/characters/kokushibo_human.png",
                "assets/images/characters/kokushibo_final.png"
            ]
        },
        {
            "id": "anime-demonslayer-015",
            "name": "Doma",
            "rating": 9.5,
            "logo": "assets/images/logos/demon-slayer/doma_logo.png",
            "alias": [
                "Upper Moon Two",
                "The Emotionless Demon",
                "Cult Leader",
                "Ice User"
            ],
            "title": [
                "Upper Rank Two of Twelve Kizuki",
                "Paradise Faith Cult Leader",
                "Shinobu's Nemesis"
            ],
            "appearance": {
                "head": {
                    "eyes": "Rainbow-colored eyes with kanji for Upper Two. Eyes show no emotion. Always smiling blankly. Can see spiritual energy",
                    "nose": "Normal nose. Can smell emotions and spiritual states",
                    "ears": "Normal ears. Ignores most sounds",
                    "extra_facial_features": "Beautiful, androgynous face with permanent empty smile. White hair with colorful tips. Hair styled elegantly. Skin pale and perfect. Looks like angel but is demon"
                },
                "body": {
                    "chest": "Slender, elegant build. Chest (38 inches) shows no muscle definition. Appears fragile but isn't. Skin pale and unmarked",
                    "arms": "Slender arms with hidden power. Biceps (12 inches) contain demonic strength. Hands delicate but deadly"
                },
                "lower_body": {
                    "legs": "Slender legs built for graceful movement. Thighs (20 inches) allow elegant footwork. Calves perfectly formed. Moves like dancer"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair styled with decorations. Sometimes wears cult leader headpiece. Always smiling"
                },
                {
                    "torso": "Extravagant cult leader robes. Multiple layers of fine silk. Colors: white with rainbow accents. Looks more like noble than demon"
                },
                {
                    "arms": "Long flowing sleeves. No armor. Hands often folded in prayer"
                },
                {
                    "legs": "Elaborate pants under robes. No leg armor. Elegant shoes"
                },
                {
                    "equipment": "Unique pair of sharp fans. Can create ice with fans. No other weapons needed. Always carries cult symbols"
                }
            ],
            "abilities": [
                {
                    "name": "Ice Blood Demon Art",
                    "type": "active",
                    "short_description": "Creates and manipulates ice",
                    "full_description": "Can freeze anything instantly. Creates ice sculptures and weapons. Freezes blood in victims' veins. Ice is unmelting without his will",
                    "image": "doma_ice_art.png"
                },
                {
                    "name": "Emotion Absorption",
                    "type": "passive/active",
                    "short_description": "Eats emotions instead of flesh",
                    "full_description": "Prefers to consume emotions rather than bodies. Can sense and taste emotions. Gains power from strong feelings. Particularly enjoys despair and devotion",
                    "image": "doma_emotion_eater.png"
                },
                {
                    "name": "Cryokinesis",
                    "type": "active",
                    "short_description": "Complete control over ice and cold",
                    "full_description": "Can lower temperature to absolute zero. Creates ice clones of himself. Freezes space around him. Can survive complete freezing",
                    "image": "doma_cryokinesis.png"
                }
            ],
            "gallery": [
                "assets/images/characters/doma_smile.png",
                "assets/images/characters/doma_ice_art.png",
                "assets/images/characters/doma_cult.png",
                "assets/images/characters/doma_fighting.png",
                "assets/images/characters/doma_serious.png"
            ]
        },
        {
            "id": "anime-demonslayer-016",
            "name": "Akaza",
            "rating": 9.7,
            "logo": "assets/images/logos/demon-slayer/akaza_logo.png",
            "alias": [
                "Upper Moon Three",
                "The Martial Artist Demon",
                "Hakuji",
                "Rengoku's Killer"
            ],
            "title": [
                "Upper Rank Three of Twelve Kizuki",
                "Master Martial Artist",
                "Compulsive Fighter"
            ],
            "appearance": {
                "head": {
                    "eyes": "Yellow eyes with blue pupils and Upper Three kanji. Eyes burn with fighting spirit. Always looking for strong opponents",
                    "nose": "Normal nose. Can smell fighting spirit",
                    "ears": "Normal ears. Can hear heartbeats in combat",
                    "extra_facial_features": "Handsome face with wild pink hair. Blue demon markings on face. Hair spiky and untamed. Permanent fierce grin. Blue lips from demon nature"
                },
                "body": {
                    "chest": "Muscular, defined torso. Chest (44 inches) shows martial artist build. Blue compass pattern on chest. Skin pale with blue markings",
                    "arms": "Powerful arms built for striking. Biceps (15 inches) perfectly developed. Hands always in fighting stance. Can deliver devastating blows"
                },
                "lower_body": {
                    "legs": "Strong legs built for kicking. Thighs (24 inches) allow powerful kicks. Calves developed for agile footwork. Always in fighting stance"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair wild and spiky. Blue markings on face. Always looks ready to fight"
                },
                {
                    "torso": "Simple black pants only. No shirt. Shows compass pattern on chest. No armor needed"
                },
                {
                    "arms": "No sleeves. Arms exposed. Wrist bands sometimes. Shows off muscles"
                },
                {
                    "legs": "Simple black pants. No leg armor. Barefoot for better footing"
                },
                {
                    "equipment": "No weapons. Fights with fists only. Sometimes wears wrist bands. No other equipment"
                }
            ],
            "abilities": [
                {
                    "name": "Destructive Death: Compass Needle",
                    "type": "active",
                    "short_description": "Martial arts style for demons",
                    "full_description": "Created from human martial arts. Uses demonic power to enhance strikes. Can create shockwaves with punches. Techniques have names like Air Type, Annihilation Type",
                    "image": "akaza_compass_needle.png"
                },
                {
                    "name": "Battle Spirit Detection",
                    "type": "passive",
                    "short_description": "Can see fighting spirit as compass",
                    "full_description": "Sees opponent's fighting spirit as bright light. Compass on chest points to weaknesses. Can predict attacks through spirit reading. Makes him nearly impossible to surprise",
                    "image": "akaza_spirit_sight.png"
                },
                {
                    "name": "Instant Regeneration",
                    "type": "passive",
                    "short_description": "Regenerates instantly from any wound",
                    "full_description": "Can regenerate head and heart destruction. Only sunlight or beheading can kill. Regeneration is near-instantaneous. Can fight while regenerating",
                    "image": "akaza_regeneration.png"
                }
            ],
            "gallery": [
                "assets/images/characters/akaza_fighting.png",
                "assets/images/characters/akaza_compass_needle.png",
                "assets/images/characters/akaza_martial_arts.png",
                "assets/images/characters/akaza_human.png",
                "assets/images/characters/akaza_final.png"
            ]
        },
        {
            "id": "anime-demonslayer-017",
            "name": "Hantengu",
            "rating": 9.0,
            "logo": "assets/images/logos/demon-slayer/hantengu_logo.png",
            "alias": [
                "Upper Moon Four",
                "The Cowardly Demon",
                "Multiple Personality Demon",
                "Emotion Clones"
            ],
            "title": [
                "Upper Rank Four of Twelve Kizuki",
                "Master of Emotion Clones",
                "Original Body Hider"
            ],
            "appearance": {
                "head": {
                    "eyes": "Multiple eye styles across clones. Main body has fearful, teary eyes. Can see through all clones simultaneously",
                    "nose": "Multiple noses across clones. Main body has runny nose from crying",
                    "ears": "Multiple ears across clones. Can hear through all clones",
                    "extra_facial_features": "Main body: old, fearful man face. Clones have different emotions: anger, joy, sorrow, pleasure. Each clone has unique appearance. All share green color scheme"
                },
                "body": {
                    "chest": "Main body: shriveled, weak torso. Clones: varied builds from muscular to slender. Each clone has different physical attributes",
                    "arms": "Main body: weak arms. Clones: powerful arms with different weapons. Each clone specializes in different attacks"
                },
                "lower_body": {
                    "legs": "Main body: weak legs. Clones: strong legs for different movement styles. Some fly, some run, some crawl"
                }
            },
            "armor_costume": [
                {
                    "head": "Main body: no helmet, looks pathetic. Clones: various head styles matching emotions"
                },
                {
                    "torso": "Main body: simple robe. Clones: varied costumes matching emotions. Anger has minimal covering, others have robes"
                },
                {
                    "arms": "Main body: no armor. Clones: various armaments. Anger has axes, others have different weapons"
                },
                {
                    "legs": "Main body: simple pants. Clones: varied leg coverings. Some have armor, some have none"
                },
                {
                    "equipment": "Multiple weapons across clones. Main body has no equipment. Each clone has specialized weapon"
                }
            ],
            "abilities": [
                {
                    "name": "Emotion Clone Creation",
                    "type": "active",
                    "short_description": "Splits into clones representing emotions",
                    "full_description": "Creates four main clones: Anger, Pleasure, Sorrow, Joy. Each has unique abilities and weapons. Clones can merge into stronger forms. Main body hides separately for survival",
                    "image": "hantengu_clones.png"
                },
                {
                    "name": "Clone Fusion: Zohakuten",
                    "type": "active",
                    "short_description": "Fuses clones into powerful dragon form",
                    "full_description": "Clones merge into wood dragon user. Controls multiple wooden dragons simultaneously. Dragons have different elemental attacks. Most powerful form besides final transformation",
                    "image": "hantengu_zohakuten.png"
                },
                {
                    "name": "Body Separation Survival",
                    "type": "passive",
                    "short_description": "Main body can hide while clones fight",
                    "full_description": "True body is small and hides. Clones can be destroyed without killing main body. Must destroy main body to win. Main body is cowardly and runs away",
                    "image": "hantengu_main_body.png"
                }
            ],
            "gallery": [
                "assets/images/characters/hantengu_main.png",
                "assets/images/characters/hantengu_clones.png",
                "assets/images/characters/hantengu_zohakuten.png",
                "assets/images/characters/hantengu_final.png",
                "assets/images/characters/hantengu_human.png"
            ]
        },
        {
            "id": "anime-demonslayer-018",
            "name": "Gyokko",
            "rating": 8.8,
            "logo": "assets/images/logos/demon-slayer/gyokko_logo.png",
            "alias": [
                "Upper Moon Five",
                "The Pot Demon",
                "Artist Demon",
                "Fish Pot User"
            ],
            "title": [
                "Upper Rank Five of Twelve Kizuki",
                "Self-Proclaimed Greatest Artist",
                "Master of Pot Transportation"
            ],
            "appearance": {
                "head": {
                    "eyes": "Multiple small eyes on fish-like face. Eyes see artistic potential in everything. No pupils, just blank white eyes",
                    "nose": "No human nose. Fish-like face with gills",
                    "ears": "No human ears. Hears through vibration sensing",
                    "extra_facial_features": "Grotesque fish-pot hybrid face. Mouth full of sharp teeth. Skin like pottery glaze. Multiple arms from pots. Looks like living artwork gone wrong"
                },
                "body": {
                    "chest": "Pot-like torso that can open. Chest contains smaller pots. Skin ceramic-like and hard. Can store things in body pots",
                    "arms": "Multiple arms growing from pots. Biceps vary in size. Hands can morph into tools. Each arm has different function"
                },
                "lower_body": {
                    "legs": "Fish-tail lower body or pot legs. Can change form as needed. Not built for running but for pot movement"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Head is pot-like. Sometimes wears decorative items. Always looks grotesque"
                },
                {
                    "torso": "Pot-like body. No clothing needed. Decorated with artistic patterns. Colors: ceramic whites and blues"
                },
                {
                    "arms": "Multiple arms from pots. No armor. Each arm has different decoration"
                },
                {
                    "legs": "Pot or fish tail lower body. No leg armor. Moves by pot teleportation mostly"
                },
                {
                    "equipment": "Multiple pots for transportation and attack. Can create weapons from pots. Carries art supplies. Always has masterpiece pots ready"
                }
            ],
            "abilities": [
                {
                    "name": "Pot Transportation",
                    "type": "active",
                    "short_description": "Teleports through pots",
                    "full_description": "Can move instantly between connected pots. Can trap enemies in pots. Pots are unbreakable from inside. Creates complex pot networks for movement",
                    "image": "gyokko_pot_transport.png"
                },
                {
                    "name": "Living Art Creation",
                    "type": "active",
                    "short_description": "Turns living things into art",
                    "full_description": "Transforms victims into fish or pottery. Artistic transformations are permanent. Creates monstrous art creatures to fight for him. Considers this 'beautification'",
                    "image": "gyokko_art_creation.png"
                },
                {
                    "name": "Thousand-Dragon Fish",
                    "type": "active",
                    "short_description": "Final form with dragon-fish creatures",
                    "full_description": "Transforms into massive fish-dragon form. Creates thousands of deadly fish. Fish can regenerate endlessly. Most powerful attack form",
                    "image": "gyokko_thousand_dragon.png"
                }
            ],
            "gallery": [
                "assets/images/characters/gyokko_pot.png",
                "assets/images/characters/gyokko_art.png",
                "assets/images/characters/gyokko_transport.png",
                "assets/images/characters/gyokko_dragon_fish.png",
                "assets/images/characters/gyokko_defeat.png"
            ]
        },
        {
            "id": "anime-demonslayer-019",
            "name": "Daki and Gyutaro",
            "rating": 9.4,
            "logo": "assets/images/logos/demon-slayer/daki_gyutaro_logo.png",
            "alias": [
                "Upper Moon Six",
                "The Sibling Demons",
                "Entertainment District Demons",
                "Two-in-One Upper Moon"
            ],
            "title": [
                "Upper Rank Six of Twelve Kizuki",
                "Entertainment District Rulers",
                "Sibling Demon Pair"
            ],
            "appearance": {
                "head": {
                    "eyes": "Daki: beautiful purple eyes with kanji. Gyutaro: fierce yellow eyes with kanji. Both can see through each other's eyes",
                    "nose": "Daki: delicate nose. Gyutaro: broken nose from human life",
                    "ears": "Both have normal hearing. Can communicate telepathically",
                    "extra_facial_features": "Daki: incredibly beautiful oiran face. Gyutaro: grotesque, skeletal face. Daki looks human, Gyutaro looks monstrous. Share body connection"
                },
                "body": {
                    "chest": "Daki: beautiful female form. Gyutaro: emaciated male form. Share life force despite separate bodies",
                    "arms": "Daki: delicate arms with obi control. Gyutaro: bony arms with sickles. Both have demonic strength"
                },
                "lower_body": {
                    "legs": "Daki: elegant legs. Gyutaro: thin legs. Both can move independently but share existence"
                }
            },
            "armor_costume": [
                {
                    "head": "Daki: elaborate oiran hairstyle. Gyutaro: wild green hair. Both have Upper Six kanji in eyes"
                },
                {
                    "torso": "Daki: extravagant kimono. Gyutaro: simple loincloth. Daki carries Gyutaro in her back"
                },
                {
                    "arms": "Daki: kimono sleeves. Gyutaro: exposed bony arms. Both have their weapons"
                },
                {
                    "legs": "Daki: kimono skirt. Gyutaro: exposed legs. Daki wears geta, Gyutaro barefoot"
                },
                {
                    "equipment": "Daki: obi sashes as weapons. Gyutaro: twin blood sickles. Share demonic power pool"
                }
            ],
            "abilities": [
                {
                    "name": "Obi Sash Control (Daki)",
                    "type": "active",
                    "short_description": "Controls obi sashes as weapons",
                    "full_description": "Can extend obi sashes to incredible lengths. Sashes can cut through buildings. Can control multiple sashes simultaneously. Sashes regenerate if cut",
                    "image": "daki_obi_control.png"
                },
                {
                    "name": "Blood Demon Art: Blood Sickles (Gyutaro)",
                    "type": "active",
                    "short_description": "Creates and controls blood sickles",
                    "full_description": "Creates twin sickles from own blood. Sickles can fly and be controlled remotely. Blood contains deadly poison. Can create blood explosions",
                    "image": "gyutaro_blood_sickles.png"
                },
                {
                    "name": "Shared Existence",
                    "type": "passive",
                    "short_description": "Both must be killed simultaneously",
                    "full_description": "They share life force and regeneration. If one survives, can regenerate the other. Must decapitate both at same time with same blade. Most difficult Upper Moon to kill",
                    "image": "sibling_shared_existence.png"
                }
            ],
            "gallery": [
                "assets/images/characters/daki_beautiful.png",
                "assets/images/characters/gyutaro_grotesque.png",
                "assets/images/characters/daki_obi.png",
                "assets/images/characters/gyutaro_sickles.png",
                "assets/images/characters/siblings_together.png"
            ]
        },
        {
            "id": "anime-demonslayer-020",
            "name": "Enmu",
            "rating": 8.5,
            "logo": "assets/images/logos/demon-slayer/enmu_logo.png",
            "alias": [
                "Lower Moon One",
                "The Dream Demon",
                "Train Demon",
                "Sleep Manipulator"
            ],
            "title": [
                "Lower Rank One of Twelve Kizuki",
                "Mugen Train Controller",
                "Dream Invasion Specialist"
            ],
            "appearance": {
                "head": {
                    "eyes": "Multiple eyes on hands and face. Main eyes are gentle-looking but deceptive. Eyes can see into dreams",
                    "nose": "Normal nose. Can smell sleep states",
                    "ears": "Normal ears. Can hear dream conversations",
                    "extra_facial_features": "Androgynous, gentle-looking face. Pale skin with black markings. Smiles constantly but insincerely. Mouth has vertical slit"
                },
                "body": {
                    "chest": "Slender, non-threatening build. Chest (36 inches) appears weak. Actually quite durable. Skin pale with dream-related markings",
                    "arms": "Slender arms with eye-palms. Biceps (11 inches) contain dream power. Hands have mouths and eyes. Can extend arms into tentacles"
                },
                "lower_body": {
                    "legs": "Slender legs built for train movement. Thighs (19 inches) allow quick escapes. Can merge with train structure"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neatly styled. Looks harmless intentionally"
                },
                {
                    "torso": "Simple dark kimono. Looks like train conductor. Colors: dark blues and blacks"
                },
                {
                    "arms": "Kimono sleeves. Arms exposed when using powers. Shows eye-palms"
                },
                {
                    "legs": "Simple pants. No leg armor. Wears simple shoes"
                },
                {
                    "equipment": "No conventional weapons. Uses dream manipulation. Carries sleep-inducing items. Controls train through demon art"
                }
            ],
            "abilities": [
                {
                    "name": "Dream Manipulation",
                    "type": "active",
                    "short_description": "Invades and controls dreams",
                    "full_description": "Can enter anyone's dreams. Creates pleasant dreams to lower guard. Places dream spell marks to destroy spiritual cores. If victim dies in dream, dies in reality",
                    "image": "enmu_dream_manipulation.png"
                },
                {
                    "name": "Train Fusion",
                    "type": "active",
                    "short_description": "Merges with and controls train",
                    "full_description": "Fuses body with Mugen Train structure. Can control all train functions. Train becomes extension of his body. Can create train monster forms",
                    "image": "enmu_train_fusion.png"
                },
                {
                    "name": "Flesh Manipulation",
                    "type": "active",
                    "short_description": "Can reshape own flesh",
                    "full_description": "Can extend arms into tentacles. Create additional eyes and mouths. Body is highly malleable. Can split into multiple bodies",
                    "image": "enmu_flesh_manipulation.png"
                }
            ],
            "gallery": [
                "assets/images/characters/enmu_gentle.png",
                "assets/images/characters/enmu_dream.png",
                "assets/images/characters/enmu_train.png",
                "assets/images/characters/enmu_monster.png",
                "assets/images/characters/enmu_defeat.png"
            ]
        },
        {
            "id": "anime-demonslayer-021",
            "name": "Rui",
            "rating": 8.7,
            "logo": "assets/images/logos/demon-slayer/rui_logo.png",
            "alias": [
                "Lower Moon Five",
                "The Spider Demon (Son)",
                "Thread User",
                "Family Seeker"
            ],
            "title": [
                "Lower Rank Five of Twelve Kizuki",
                "Spider Family Leader",
                "Mt. Natagumo Controller"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, childlike eyes with Lower Five kanji. Eyes show loneliness and longing. Can see spiritual threads connecting beings",
                    "nose": "Small, childlike nose. Normal sensitivity",
                    "ears": "Normal ears. Can hear spider web vibrations",
                    "extra_facial_features": "Childlike face that belies cruelty. Pale skin with red markings. Hair white with black tips. Looks like innocent child but is deadly"
                },
                "body": {
                    "chest": "Child-sized torso. Chest (30 inches) appears weak. Actually contains demonic power. Skin pale with spider web patterns",
                    "arms": "Slender child arms. Biceps (9 inches) can create strong threads. Hands can produce spider silk"
                },
                "lower_body": {
                    "legs": "Child-sized legs. Thighs (15 inches) allow quick movement. Can walk on own threads"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neatly cut. Looks like human child"
                },
                {
                    "torso": "Simple white kimono. Looks like mourning clothes. Colors: white and red accents"
                },
                {
                    "arms": "Kimono sleeves. Arms exposed when using threads",
                    "legs": "Simple hakama pants. No leg armor. Barefoot usually"
                },
                {
                    "equipment": "No conventional weapons. Uses spider threads. Controls spider family. Lives in web-covered mountain"
                }
            ],
            "abilities": [
                {
                    "name": "Thread Manipulation",
                    "type": "active",
                    "short_description": "Creates and controls razor-sharp threads",
                    "full_description": "Can produce threads sharp enough to cut stone. Creates complex web structures. Threads can be controlled remotely. Can sense everything touching threads",
                    "image": "rui_threads.png"
                },
                {
                    "name": "Demon Family Creation",
                    "type": "active",
                    "short_description": "Creates artificial demon family",
                    "full_description": "Forces demons to play family roles. Kills those who disobey family rules. Seeks perfect family to replace human one. Extremely possessive of 'family' members",
                    "image": "rui_family.png"
                },
                {
                    "name": "Web Domain",
                    "type": "active",
                    "short_description": "Creates territory covered in threads",
                    "full_description": "Covers entire mountain in spider webs. Web acts as sensor network. Can attack anyone in territory. Territory is deadly trap for intruders",
                    "image": "rui_web_domain.png"
                }
            ],
            "gallery": [
                "assets/images/characters/rui_child.png",
                "assets/images/characters/rui_threads.png",
                "assets/images/characters/rui_family.png",
                "assets/images/characters/rui_web.png",
                "assets/images/characters/rui_memory.png"
            ]
        },
        {
            "id": "anime-demonslayer-022",
            "name": "Muzan Kibutsuji",
            "rating": 10.0,
            "logo": "assets/images/logos/demon-slayer/muzan_logo.png",
            "alias": [
                "Demon King",
                "Original Demon",
                "Progenitor of Demons",
                "The Ultimate Evil"
            ],
            "title": [
                "King of Demons",
                "Progenitor of All Demons",
                "Twelve Kizuki Creator",
                "Immortal Being"
            ],
            "appearance": {
                "head": {
                    "eyes": "Sharp, predatory red eyes with slit pupils. Eyes show no humanity or emotion. Can see in complete darkness. Eyes change color when angry",
                    "nose": "Perfect aristocratic nose. Can smell fear and blood from miles away",
                    "ears": "Perfect hearing. Can hear whispers across cities",
                    "extra_facial_features": "Perfectly handsome face that can change appearance. Black hair styled elegantly. Skin pale and flawless. Can appear as man, woman, or child. True form is monstrous"
                },
                "body": {
                    "chest": "Perfect human form when disguised. True form has multiple mouths and eyes. Can shapeshift any body part. Skin can harden to diamond density",
                    "arms": "Can grow multiple arms. Arms can extend into whips or blades. Each finger can become weapon. Can create weapons from own flesh"
                },
                "lower_body": {
                    "legs": "Can grow multiple legs. Legs can become tentacles. Can move at incredible speeds. Can transform lower body entirely"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair perfectly styled. Wears elegant hats when in disguise"
                },
                {
                    "torso": "Elegant suits or kimonos when disguised. True form has no clothing. Prefers expensive, fine clothing"
                },
                {
                    "arms": "No armor. Arms exposed or covered by sleeves. Shows perfection in human form"
                },
                {
                    "legs": "Fine pants or kimono skirts. Wears expensive shoes. Everything of highest quality"
                },
                {
                    "equipment": "No weapons needed. Own body is ultimate weapon. Sometimes carries walking cane. Always has demon servants nearby"
                }
            ],
            "abilities": [
                {
                    "name": "Complete Shapeshifting",
                    "type": "active",
                    "short_description": "Can become anyone or anything",
                    "full_description": "Can change age, gender, appearance at will. Can split into multiple bodies. Can transform body parts into weapons. Only sunlight can reveal true form",
                    "image": "muzan_shapeshift.png"
                },
                {
                    "name": "Biokinesis",
                    "type": "active",
                    "short_description": "Complete control over own biology",
                    "full_description": "Can control every cell in body. Can create demons from own blood. Can modify own biology instantly. Can heal any injury except sunlight",
                    "image": "muzan_biokinesis.png"
                },
                {
                    "name": "Demon Creation and Control",
                    "type": "active",
                    "short_description": "Creates and controls all demons",
                    "full_description": "All demons are connected to him. Can kill any demon remotely. Can see through demons' eyes. Can communicate telepathically with demons",
                    "image": "muzan_demon_control.png"
                },
                {
                    "name": "Multiple Lives",
                    "type": "passive",
                    "short_description": "Has multiple brains and hearts",
                    "full_description": "Seven hearts and five brains in true form. Must destroy all simultaneously to kill. Each organ can function independently. Most difficult being to kill in existence",
                    "image": "muzan_multiple_organs.png"
                }
            ],
            "gallery": [
                "assets/images/characters/muzan_human.png",
                "assets/images/characters/muzan_true_form.png",
                "assets/images/characters/muzan_shapeshift.png",
                "assets/images/characters/muzan_demon_king.png",
                "assets/images/characters/muzan_final.png"
            ]
        },
        {
            "id": "anime-demonslayer-023",
            "name": "Kagaya Ubuyashiki",
            "rating": 9.8,
            "logo": "assets/images/logos/demon-slayer/kagaya_logo.png",
            "alias": [
                "Oyakata-sama",
                "Demon Slayer Corps Leader",
                "Cursed Clan Head",
                "The Gentle Leader"
            ],
            "title": [
                "97th Leader of Demon Slayer Corps",
                "Ubuyashiki Family Head",
                "Muzan's Curse Bearer"
            ],
            "appearance": {
                "head": {
                    "eyes": "Cloudy, blind eyes that still see deeply. Eyes show wisdom and pain. Despite blindness, sees people's hearts",
                    "nose": "Delicate nose. Can smell sincerity and intentions",
                    "ears": "Exceptional hearing. Listens to all Corps members equally",
                    "extra_facial_features": "Beautiful, ethereal face marred by curse. Skin pale and translucent. Purple curse markings across face. Always gentle smile despite pain. Looks fragile but spirit is strong"
                },
                "body": {
                    "chest": "Frail, weakened body. Chest (34 inches) shows illness. Body deteriorating from curse. Skin covered in curse markings. Cannot stand or move without help",
                    "arms": "Thin, weak arms. Biceps (10 inches) show no strength. Hands delicate but often folded in prayer. Cannot hold weapons"
                },
                "lower_body": {
                    "legs": "Atrophied legs from lack of use. Thighs (16 inches) weak. Cannot walk. Always seated or carried"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neatly styled. Often has flower in hair. Looks serene despite pain"
                },
                {
                    "torso": "Elegant white kimono. Kimono shows status but not armor. Colors: white and purple theme"
                },
                {
                    "arms": "Kimono sleeves. No armor. Hands often covered by sleeves"
                },
                {
                    "legs": "Kimono covers legs. No leg armor. Never wears shoes indoors"
                },
                {
                    "equipment": "No weapons. Carries communication bells. Has family heirlooms. Always has medical supplies nearby"
                }
            ],
            "abilities": [
                {
                    "name": "Charismatic Leadership",
                    "type": "passive",
                    "short_description": "Inspires absolute loyalty",
                    "full_description": "Can command Hashira with mere words. Inspires devotion in all Corps members. Can calm angry hearts with presence. Leadership holds Corps together for centuries",
                    "image": "kagaya_leadership.png"
                },
                {
                    "name": "Strategic Genius",
                    "type": "passive",
                    "short_description": "Master strategist and planner",
                    "full_description": "Plans centuries ahead against Muzan. Coordinates all Corps operations perfectly. Anticipates demon movements. Sets final plan in motion despite own death",
                    "image": "kagaya_strategy.png"
                },
                {
                    "name": "Curse Resistance",
                    "type": "passive",
                    "short_description": "Bears Muzan's curse for family",
                    "full_description": "All male Ubuyashiki die young from curse. Bears curse so others might live. Uses curse to track Muzan. Sacrifice is key to final battle",
                    "image": "kagaya_curse.png"
                }
            ],
            "gallery": [
                "assets/images/characters/kagaya_gentle.png",
                "assets/images/characters/kagaya_family.png",
                "assets/images/characters/kagaya_curse.png",
                "assets/images/characters/kagaya_final.png",
                "assets/images/characters/kagaya_legacy.png"
            ]
        },
        {
            "id": "anime-demonslayer-024",
            "name": "Amane Ubuyashiki",
            "rating": 9.5,
            "logo": "assets/images/logos/demon-slayer/amane_logo.png",
            "alias": [
                "Oyakata-sama's Wife",
                "Corps Matriarch",
                "Kagaya's Support",
                "Twin Mother"
            ],
            "title": [
                "Wife of Corps Leader",
                "Mother of Ubuyashiki Heirs",
                "Corps Support Leader"
            ],
            "appearance": {
                "head": {
                    "eyes": "Kind, gentle eyes that show strength. Eyes see everything in household. Always watching over family and Corps",
                    "nose": "Delicate nose. Can smell trouble before it happens",
                    "ears": "Good hearing. Listens to all family matters",
                    "extra_facial_features": "Beautiful, mature face. Hair styled traditionally. Always calm expression. Shows both gentleness and iron will"
                },
                "body": {
                    "chest": "Slender motherly frame. Chest (35 inches) shows woman who has borne children. Always perfect posture",
                    "arms": "Slender arms with hidden strength. Biceps (11 inches) from caring work. Hands always busy helping"
                },
                "lower_body": {
                    "legs": "Slender legs built for constant movement. Thighs (20 inches) allow quick household management. Always on feet caring for others"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair in traditional married woman style. Always neat and proper"
                },
                {
                    "torso": "Elegant kimono suitable for leadership wife. Colors subdued but elegant. Always perfectly dressed"
                },
                {
                    "arms": "Kimono sleeves. No armor. Hands often busy with tasks"
                },
                {
                    "legs": "Kimono skirt. No leg armor. Wears traditional footwear"
                },
                {
                    "equipment": "No weapons. Carries household keys. Always has medical supplies. Manages entire estate"
                }
            ],
            "abilities": [
                {
                    "name": "Estate Management",
                    "type": "passive/active",
                    "short_description": "Manages entire Corps headquarters",
                    "full_description": "Runs massive estate seamlessly. Coordinates all domestic operations. Manages staff of hundreds. Keeps everything running despite crisis",
                    "image": "amane_management.png"
                },
                {
                    "name": "Family Care",
                    "type": "passive/active",
                    "short_description": "Cares for husband and children",
                    "full_description": "Supports dying husband emotionally. Raises five children alone. Maintains family traditions. Prepares children for leadership",
                    "image": "amane_family_care.png"
                },
                {
                    "name": "Ceremonial Leadership",
                    "type": "active",
                    "short_description": "Leads Corps ceremonies and traditions",
                    "full_description": "Conducts important Corps rituals. Maintains centuries of tradition. Ensures continuity of leadership. Represents Corps in formal matters",
                    "image": "amane_ceremonial.png"
                }
            ],
            "gallery": [
                "assets/images/characters/amane_kagaya.png",
                "assets/images/characters/amane_children.png",
                "assets/images/characters/amane_estate.png",
                "assets/images/characters/amane_strong.png",
                "assets/images/characters/amane_legacy.png"
            ]
        },
        {
            "id": "anime-demonslayer-025",
            "name": "Kiriya Ubuyashiki",
            "rating": 9.2,
            "logo": "assets/images/logos/demon-slayer/kiriya_logo.png",
            "alias": [
                "Young Oyakata-sama",
                "Boy Leader",
                "Final Corps Leader",
                "Twin Successor"
            ],
            "title": [
                "98th Leader of Demon Slayer Corps",
                "Youngest Corps Leader in History",
                "Ubuyashiki Twin"
            ],
            "appearance": {
                "head": {
                    "eyes": "Young but wise eyes. Eyes show burden of leadership. Already see more than most adults",
                    "nose": "Small child nose. Normal sensitivity",
                    "ears": "Good hearing. Listens to advisors carefully",
                    "extra_facial_features": "Young boy face that is serious beyond years. Hair neatly cut. Wears father's mantle. Expression always serious and focused"
                },
                "body": {
                    "chest": "Small child frame. Chest (28 inches) shows youth. Already bears curse markings. Skin pale like father",
                    "arms": "Small child arms. Biceps (8 inches) no strength. Hands often holding leadership items"
                },
                "lower_body": {
                    "legs": "Small child legs. Thighs (14 inches) young. Already learning to lead despite age"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neat. Wears simple headband sometimes"
                },
                {
                    "torso": "Miniature version of father's kimono. Colors: white and purple. Wears leadership mantle"
                },
                {
                    "arms": "Kimono sleeves. No armor. Hands often holding something important"
                },
                {
                    "legs": "Kimono covers legs. No leg armor. Wears small sandals"
                },
                {
                    "equipment": "Father's bells and communication devices. Leadership seals and documents. Always has advisors nearby"
                }
            ],
            "abilities": [
                {
                    "name": "Inherited Leadership",
                    "type": "passive",
                    "short_description": "Born and trained to lead",
                    "full_description": "Trained since birth to lead Corps. Knows all Corps secrets and operations. Can command Hashira despite age. Continues father's final plan",
                    "image": "kiriya_leadership.png"
                },
                {
                    "name": "Twin Coordination",
                    "type": "active",
                    "short_description": "Works perfectly with twin sister",
                    "full_description": "Coordinates with sister Kanata seamlessly. They share leadership duties. Can communicate without words. Perfect teamwork in crisis",
                    "image": "kiriya_twin_coordination.png"
                },
                {
                    "name": "Curse Management",
                    "type": "passive",
                    "short_description": "Manages family curse for new era",
                    "full_description": "Bears curse but plans to end it. Uses curse connection strategically. Final leader if plan succeeds. Breaks curse cycle",
                    "image": "kiriya_curse_management.png"
                }
            ],
            "gallery": [
                "assets/images/characters/kiriya_young.png",
                "assets/images/characters/kiriya_leader.png",
                "assets/images/characters/kiriya_twin.png",
                "assets/images/characters/kiriya_command.png",
                "assets/images/characters/kiriya_future.png"
            ]
        },
        {
            "id": "anime-demonslayer-026",
            "name": "Kanao Tsuyuri",
            "rating": 9.3,
            "logo": "assets/images/logos/demon-slayer/kanao_logo.png",
            "alias": [
                "Flower Breathing User",
                "Coin Flipper",
                "Shinobu's Tsuguko",
                "Emotionless Girl"
            ],
            "title": [
                "Demon Slayer Corps Member",
                "Flower Breathing Successor",
                "Shinobu's Adopted Sister"
            ],
            "appearance": {
                "head": {
                    "eyes": "Large, beautiful purple eyes. Once empty, now showing emotion. Eyes see everything in detail. Can analyze movements perfectly",
                    "nose": "Small, delicate nose. Normal sensitivity",
                    "ears": "Good hearing. Listens carefully when spoken to",
                    "extra_facial_features": "Beautiful, doll-like face. Purple eyes and hair. Hair in side ponytail with butterfly hairpin. Often blank expression learning to show feelings"
                },
                "body": {
                    "chest": "Slender, athletic build. Chest (33 inches) shows training. Skin pale but healthy",
                    "arms": "Slender arms with precise strength. Biceps (11 inches) perfect for Flower Breathing. Hands delicate but sword grip perfect"
                },
                "lower_body": {
                    "legs": "Slender legs built for graceful movement. Thighs (19 inches) allow flower-like footwork. Calves perfectly toned"
                }
            },
            "armor_costume": [
                {
                    "head": "Butterfly hairpin like Shinobu's. Hair in side ponytail. No helmet"
                },
                {
                    "torso": "Standard uniform with butterfly haori. Haori is gift from Shinobu. Colors: purple and white theme"
                },
                {
                    "arms": "Standard sleeves. No armor. Hands often hold coin"
                },
                {
                    "legs": "Standard hakama pants. Leg wrappings. Tabi boots"
                },
                {
                    "equipment": "Standard Nichirin sword that turns pale pink. Special coin for decision making. Standard demon-slaying kit. Butterfly message system"
                }
            ],
            "abilities": [
                {
                    "name": "Flower Breathing",
                    "type": "active",
                    "short_description": "Graceful breathing style focusing on precision",
                    "full_description": "Mastered all Flower Breathing forms. Techniques create flower petal visual effects. Focuses on precise, vital strikes. Can combine with insect breathing techniques",
                    "image": "kanao_flower_breathing.png"
                },
                {
                    "name": "Total Concentration: Constant",
                    "type": "passive",
                    "short_description": "Maintains breathing technique constantly",
                    "full_description": "Can maintain enhanced state 24/7. All physical abilities maximized constantly. Rare ability among slayers. Trained by Shinobu specifically",
                    "image": "kanao_total_concentration.png"
                },
                {
                    "name": "Enhanced Vision",
                    "type": "passive",
                    "short_description": "Can see minute details and movements",
                    "full_description": "Trained to see everything in combat. Can analyze opponent's techniques instantly. Sees openings others miss. Vision is key to her fighting style",
                    "image": "kanao_enhanced_vision.png"
                }
            ],
            "gallery": [
                "assets/images/characters/kanao_emotionless.png",
                "assets/images/characters/kanao_flower_breathing.png",
                "assets/images/characters/kanao_coin.png",
                "assets/images/characters/kanao_emotional.png",
                "assets/images/characters/kanao_future.png"
            ]
        },
        {
            "id": "anime-demonslayer-027",
            "name": "Genya Shinazugawa",
            "rating": 9.1,
            "logo": "assets/images/logos/demon-slayer/genya_logo.png",
            "alias": [
                "Demon-Eating Slayer",
                "Sanemi's Brother",
                "Gun User",
                "Partial Demon"
            ],
            "title": [
                "Demon Slayer Corps Member",
                "Unique Demon Power User",
                "Sanemi's Younger Brother"
            ],
            "appearance": {
                "head": {
                    "eyes": "Sharp, fierce eyes like brother's. Eyes show determination and pain. Can see demonic energy after eating demons",
                    "nose": "Strong nose. Can smell demon flesh he needs",
                    "ears": "Normal ears. Ignores brother's harsh words",
                    "extra_facial_features": "Wild, angry face similar to Sanemi. White hair spiky. Multiple scars on face. Permanent scowl or determined expression"
                },
                "body": {
                    "chest": "Muscular, defined torso. Chest (42 inches) shows strength. Skin bears demonic markings when powered up",
                    "arms": "Powerful arms for gun use. Biceps (14 inches) from training. Hands calloused from weapons"
                },
                "lower_body": {
                    "legs": "Strong legs built for positioning. Thighs (23 inches) allow quick repositioning. Calves developed for gunner stance"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair wild like brother's. Often has bandage on face"
                },
                {
                    "torso": "Standard uniform open at chest. Shows scars like brother. No haori. Looks rough and ready"
                },
                {
                    "arms": "No sleeves. Arms exposed. Bandages on arms sometimes"
                },
                {
                    "legs": "Standard pants. Leg wrappings. Sturdy boots"
                },
                {
                    "equipment": "Double-barreled shotgun for close combat. Nichirin sword for emergencies. Demon flesh for power ups. Standard demon-slaying kit"
                }
            ],
            "abilities": [
                {
                    "name": "Demon Consumption",
                    "type": "active",
                    "short_description": "Gains powers by eating demons",
                    "full_description": "Can temporarily gain demon abilities by eating them. Gains regeneration, strength, unique powers. Effect is temporary. Must consume demon flesh to activate",
                    "image": "genya_demon_eating.png"
                },
                {
                    "name": "Firearm Mastery",
                    "type": "active",
                    "short_description": "Expert use of specially designed guns",
                    "full_description": "Uses guns with nichirin bullets. Can damage demons at range. Skilled in close-quarters gun combat. Modified guns for demon slaying",
                    "image": "genya_gun_mastery.png"
                },
                {
                    "name": "Partial Demon Transformation",
                    "type": "active",
                    "short_description": "Can partially transform into demon",
                    "full_description": "Grows fangs and claws when using power. Skin becomes demon-like. Gains enhanced senses and regeneration. Maintains human consciousness",
                    "image": "genya_transformation.png"
                }
            ],
            "gallery": [
                "assets/images/characters/genya_angry.png",
                "assets/images/characters/genya_gun.png",
                "assets/images/characters/genya_demon_eat.png",
                "assets/images/characters/genya_transformation.png",
                "assets/images/characters/genya_brothers.png"
            ]
        },
        {
            "id": "anime-demonslayer-028",
            "name": "Murata",
            "rating": 8.0,
            "logo": "assets/images/logos/demon-slayer/murata_logo.png",
            "alias": [
                "Average Slayer",
                "Survivor Slayer",
                "Mt. Natagumo Survivor",
                "Reliable Comrade"
            ],
            "title": [
                "Demon Slayer Corps Member",
                "Experienced Lower Rank Slayer",
                "Tanjiro's Comrade"
            ],
            "appearance": {
                "head": {
                    "eyes": "Normal, determined eyes. Eyes show experience and caution. Not exceptional but reliable",
                    "nose": "Normal nose. Average sensitivity",
                    "ears": "Normal ears. Good hearing but not exceptional",
                    "extra_facial_features": "Average, friendly face. Brown hair in simple style. Looks like everyman. Expression usually serious but kind"
                },
                "body": {
                    "chest": "Average athletic build. Chest (38 inches) shows training. Skin has some scars from battles",
                    "arms": "Average arms for swordsman. Biceps (13 inches) decent. Hands calloused from training"
                },
                "lower_body": {
                    "legs": "Average legs built for standard movement. Thighs (21 inches) adequate. Calves normally developed"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neat. Sometimes wears headband"
                },
                {
                    "torso": "Standard uniform. No haori. Uniform well-maintained"
                },
                {
                    "arms": "Standard sleeves. No armor. Normal gloves"
                },
                {
                    "legs": "Standard hakama pants. Leg wrappings. Tabi boots"
                },
                {
                    "equipment": "Standard Nichirin sword. Standard demon-slaying kit. Nothing special but reliable"
                }
            ],
            "abilities": [
                {
                    "name": "Water Breathing (Basic)",
                    "type": "active",
                    "short_description": "Standard Water Breathing techniques",
                    "full_description": "Knows basic Water Breathing forms. Not master level but competent. Can handle lower rank demons. Reliable in group combat",
                    "image": "murata_water_breathing.png"
                },
                {
                    "name": "Survival Instinct",
                    "type": "passive",
                    "short_description": "Exceptional ability to survive",
                    "full_description": "Survived multiple deadly encounters. Knows when to retreat and regroup. Good at assessing danger levels. Reliable comrade in dangerous situations",
                    "image": "murata_survival.png"
                },
                {
                    "name": "Team Coordination",
                    "type": "active",
                    "short_description": "Good at working in teams",
                    "full_description": "Coordinates well with other slayers. Good at following orders. Can lead small groups when needed. Reliable support in battles",
                    "image": "murata_teamwork.png"
                }
            ],
            "gallery": [
                "assets/images/characters/murata_normal.png",
                "assets/images/characters/murata_water.png",
                "assets/images/characters/murata_survival.png",
                "assets/images/characters/murata_team.png",
                "assets/images/characters/murata_final.png"
            ]
        },
        {
            "id": "anime-demonslayer-029",
            "name": "Yoriichi Tsugikuni",
            "rating": 10.0,
            "logo": "assets/images/logos/demon-slayer/yoriichi_logo.png",
            "alias": [
                "The Original Sun Breath User",
                "Strongest Demon Slayer Ever",
                "Muzan's Nightmare",
                "Prodigy of Prodigies"
            ],
            "title": [
                "Creator of Sun Breathing",
                "Original Demon Slayer",
                "Muzan's Only Fear",
                "Legendary Swordsman"
            ],
            "appearance": {
                "head": {
                    "eyes": "Piercing, focused eyes with flame-like pupils. Eyes can see Transparent World naturally. See everything including life force",
                    "nose": "Strong nose. Can smell demonic presence miles away",
                    "ears": "Exceptional hearing. Can hear heartbeats and muscle movements",
                    "extra_facial_features": "Serious, focused face. Red hair and markings like flame. Hanafuda earrings like Tanjiro's. Expression shows absolute focus"
                },
                "body": {
                    "chest": "Perfect swordsman physique. Chest (43 inches) shows peak human form. Skin bears sun-like markings. Perfect balance and posture",
                    "arms": "Perfect arms for swordsmanship. Biceps (15 inches) perfectly developed. Hands grip sword with absolute control"
                },
                "lower_body": {
                    "legs": "Perfect legs for movement. Thighs (24 inches) allow instant acceleration. Calves developed for perfect footwork"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neat. Hanafuda earrings always worn"
                },
                {
                    "torso": "Simple demon slayer garb. No elaborate armor. Colors: red and black theme"
                },
                {
                    "arms": "Simple sleeves. No armor. Arms free for movement"
                },
                {
                    "legs": "Simple pants. Leg wrappings. Simple footwear"
                },
                {
                    "equipment": "Standard Nichirin sword that turns bright red. No other equipment needed. Sword is extension of self"
                }
            ],
            "abilities": [
                {
                    "name": "Sun Breathing (Original)",
                    "type": "active",
                    "short_description": "Original and most powerful breathing style",
                    "full_description": "Created all other breathing styles. Thirteen forms that mimic sun. Creates actual solar heat and light. Can burn demons like actual sunlight. Perfected beyond any other style",
                    "image": "yoriichi_sun_breathing.png"
                },
                {
                    "name": "Transparent World (Natural)",
                    "type": "passive",
                    "short_description": "Born able to see Transparent World",
                    "full_description": "Can see muscles, blood flow, bone structure naturally. Can predict all movements before they happen. Sees life force and weaknesses. Born with this ability, not trained",
                    "image": "yoriichi_transparent_world.png"
                },
                {
                    "name": "Selfless State",
                    "type": "passive",
                    "short_description": "Cannot be detected by battle spirit",
                    "full_description": "Eliminates all fighting spirit and killing intent. Cannot be sensed or predicted. Makes him invisible to demon senses. Ultimate stealth state",
                    "image": "yoriichi_selfless_state.png"
                },
                {
                    "name": "Perfect Control",
                    "type": "passive",
                    "short_description": "Absolute control over all movements",
                    "full_description": "Every movement is perfect and efficient. No wasted motion or energy. Can fight for days without tiring. Physical perfection achieved",
                    "image": "yoriichi_perfect_control.png"
                }
            ],
            "gallery": [
                "assets/images/characters/yoriichi_serious.png",
                "assets/images/characters/yoriichi_sun_breathing.png",
                "assets/images/characters/yoriichi_muzan.png",
                "assets/images/characters/yoriichi_young.png",
                "assets/images/characters/yoriichi_legend.png"
            ]
        },
        {
            "id": "anime-demonslayer-030",
            "name": "Tamayo",
            "rating": 9.6,
            "logo": "assets/images/logos/demon-slayer/tamayo_logo.png",
            "alias": [
                "Good Demon Doctor",
                "Muzan's Rebel",
                "Medicine Creator",
                "Yushiro's Protector"
            ],
            "title": [
                "Renegade Demon Doctor",
                "Medicine Researcher",
                "Muzan's First Rebel",
                "Demon Cure Developer"
            ],
            "appearance": {
                "head": {
                    "eyes": "Kind, intelligent purple eyes. Eyes show centuries of wisdom and compassion. Can see microscopic details for medicine",
                    "nose": "Delicate nose. Can smell diseases and poisons",
                    "ears": "Good hearing. Listens carefully to patients",
                    "extra_facial_features": "Beautiful, mature face. Purple hair styled elegantly. Looks like refined noblewoman. Expression always kind and intelligent"
                },
                "body": {
                    "chest": "Slender, graceful build. Chest (34 inches) shows no combat training. Skin pale but healthy for demon",
                    "arms": "Slender arms for medical work. Biceps (10 inches) delicate. Hands skilled for surgery and medicine"
                },
                "lower_body": {
                    "legs": "Slender legs built for clinic movement. Thighs (19 inches) allow quick movement in lab. Graceful movements"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair elegantly styled. Often wears hair ornaments"
                },
                {
                    "torso": "Elegant kimono suitable for doctor. Colors: purple and white theme. Always looks professional"
                },
                {
                    "arms": "Kimono sleeves. No armor. Hands often gloved for medical work"
                },
                {
                    "legs": "Kimono skirt. No leg armor. Wears traditional footwear"
                },
                {
                    "equipment": "Medical equipment and supplies. Research notes and formulas. Medicine for demon cure. Protection charms from Yushiro"
                }
            ],
            "abilities": [
                {
                    "name": "Medical Genius",
                    "type": "passive/active",
                    "short_description": "Centuries of medical knowledge",
                    "full_description": "Has studied medicine for 400+ years. Understands demon biology completely. Created medicines that affect demons. Developing cure for demon transformation",
                    "image": "tamayo_medical.png"
                },
                {
                    "name": "Blood Demon Art: Organic Manipulation",
                    "type": "active",
                    "short_description": "Can manipulate organic matter",
                    "full_description": "Can analyze and manipulate biological material. Creates medicines from own blood. Can temporarily paralyze demons. Uses art for healing, not combat",
                    "image": "tamayo_blood_art.png"
                },
                {
                    "name": "Muzan's Curse Resistance",
                    "type": "passive",
                    "short_description": "Resists Muzan's control completely",
                    "full_description": "First demon to break free from Muzan. Developed method to resist control. Can hide from Muzan's detection. Teaches others to resist",
                    "image": "tamayo_curse_resistance.png"
                }
            ],
            "gallery": [
                "assets/images/characters/tamayo_kind.png",
                "assets/images/characters/tamayo_medical.png",
                "assets/images/characters/tamayo_yushiro.png",
                "assets/images/characters/tamayo_research.png",
                "assets/images/characters/tamayo_sacrifice.png"
            ]
        },
        {
            "id": "anime-demonslayer-031",
            "name": "Yushiro",
            "rating": 9.0,
            "logo": "assets/images/logos/demon-slayer/yushiro_logo.png",
            "alias": [
                "Tamayo's Protector",
                "Illusion Demon",
                "Devoted Assistant",
                "Camouflage User"
            ],
            "title": [
                "Tamayo's Assistant and Protector",
                "Illusion Blood Demon Art User",
                "Demon Medicine Assistant"
            ],
            "appearance": {
                "head": {
                    "eyes": "Sharp, focused eyes. Eyes show devotion to Tamayo. Can see through own illusions",
                    "nose": "Normal nose. Can smell threats to Tamayo",
                    "ears": "Good hearing. Listens for danger constantly",
                    "extra_facial_features": "Young, serious face. Black hair with purple tips. Often scowling, especially at intruders. Only smiles around Tamayo"
                },
                "body": {
                    "chest": "Slender, athletic build. Chest (36 inches) shows some training. Skin pale like demon",
                    "arms": "Slender arms with some strength. Biceps (12 inches) from protection duties. Hands often making medicine or fighting"
                },
                "lower_body": {
                    "legs": "Slender legs built for quick movement. Thighs (20 inches) allow rapid protection responses. Agile movements"
                }
            },
            "armor_costume": [
                {
                    "head": "No helmet. Hair neat. Often looks annoyed"
                },
                {
                    "torso": "Simple dark kimono. Practical for work. Colors: black and purple theme"
                },
                {
                    "arms": "Kimono sleeves rolled up for work. No armor"
                },
                {
                    "legs": "Simple pants. No leg armor. Practical footwear"
                },
                {
                    "equipment": "Medicine-making tools. Illusion talismans. Protection devices for Tamayo. Basic combat tools"
                }
            ],
            "abilities": [
                {
                    "name": "Blood Demon Art: Illusion Creation",
                    "type": "active",
                    "short_description": "Creates realistic illusions",
                    "full_description": "Can create illusions that hide people and places. Illusions are perfect and undetectable. Can make entire building disappear. Uses talismans to activate illusions",
                    "image": "yushiro_illusions.png"
                },
                {
                    "name": "Enhanced Agility",
                    "type": "passive",
                    "short_description": "Extremely fast and agile",
                    "full_description": "Moves faster than eye can follow. Can dodge most attacks easily. Agile enough to protect Tamayo from any threat. Speed is primary defense",
                    "image": "yushiro_agility.png"
                },
                {
                    "name": "Medicine Assistance",
                    "type": "active",
                    "short_description": "Skilled medical assistant",
                    "full_description": "Helps Tamayo with all medical research. Can prepare complex medicines. Understands demon biology well. Essential to cure development",
                    "image": "yushiro_medicine.png"
                }
            ],
            "gallery": [
                "assets/images/characters/yushiro_annoyed.png",
                "assets/images/characters/yushiro_illusions.png",
                "assets/images/characters/yushiro_tamayo.png",
                "assets/images/characters/yushiro_protection.png",
                "assets/images/characters/yushiro_future.png"
            ]
        }
    ]
}